return {
  titles = {
    "1,TA2: Парова доба",
    "2,Парова машина",
    "3,TA2 Топка",
    "3,TA2 Водонагрівач",
    "3,TA2 Циліндр",
    "3,TA2 Маховик",
    "3,TA2 Парові труби",
    "3,TA2 Приводний вал / TA2 Редуктор",
    "3,TA2 Електрогенератор",
    "2,TA2 Накопичувач енергії",
    "3,TA2 Лебідка",
    "3,TA2 Вантажна скриня",
    "3,TA2 Зчеплення",
    "2,Штовхач і сортування предметів",
    "3,TechAge труба",
    "3,Концентратор труб",
    "3,TA2 Штовхач",
    "3,TA2 Розподільник",
    "2,Промивання гравію",
    "3,TA2 Промивач",
    "2,Видобуток каменю\\, подрібнення та просіювання",
    "3,TA2 Кар'єр",
    "3,TA2 Подрібнювач",
    "3,TA2 Просіювач",
    "2,Виробництво предметів",
    "3,TA2 Автокрафтер",
    "3,TA2 Фабрика електроніки",
    "2,Інші блоки",
    "3,TA2 Наповнювач рідини",
    "3,TA2 Захищена скриня",
    "3,Блок завантаження карти",
  },
  texts = {
    "TA2 - це будівництво та експлуатація перших машин для переробки руди. Деякі машини повинні приводитися в рух за допомогою ведучих осей. Для цього потрібно побудувати парову машину та топити її вугіллям або деревним паливом.\n"..
    "\n"..
    "У TA2 також є гравійний промивач\\, який можна використовувати для промивання рідкісних руд\\, таких як самородки усмію. Ці самородки знадобляться вам пізніше для подальших рецептів.\n"..
    "\n"..
    "\n"..
    "\n",
    "Парова машина складається з декількох блоків і повинна бути зібрана\\, як показано на плані праворуч. Необхідні блоки TA2 «Топка»\\, TA2 «Верх котла»\\, TA2 «Низ котла»\\, TA2 «Циліндр»\\, TA2 «Маховик» та парові труби.\n"..
    "\n"..
    "Крім того\\, необхідні ведучі осі та блоки шестерень для зміни напрямку руху. Маховик повинен бути з'єднаний з усіма машинами\\, які повинні приводитися в рух через ведучі мости.\n"..
    "\n"..
    "При встановленні завжди звертайте увагу на вирівнювання всіх блоків:\n"..
    "\n"..
    "  - Циліндр зліва\\, маховик справа.\n"..
    "  - Підключайте парові труби там\\, де є відповідний отвір\n"..
    "  - Ведуча вісь на маховику тільки справа\n"..
    "  - У всіх машинах ведучі осі можуть бути підключені з усіх сторін\\, які не зайняті іншими функціями\\, наприклад\\, отворами IN та OUT у подрібнювачі та просіювачі.\n"..
    "\n"..
    "Котел повинен бути заповнений водою. Залийте в котел до 10 відер води.\n"..
    "Топка повинна бути заповнена вугіллям або деревним вугіллям.\n"..
    "Коли вода нагріється (індикатор температури вгорі)\\, можна запустити парову машину.\n"..
    "\n"..
    "Потужність парової машини становить 25 ku\\, тому вона може приводити в рух кілька машин одночасно.\n"..
    "\n"..
    "\n"..
    "\n",
    "Частина парової машини.\n"..
    "\n"..
    "Топка повинна бути заповнена вугіллям або деревним вугіллям. Час горіння залежить від потужності\\, яку вимагає парова машина. Вугілля горить 32 сек\\, а деревне вугілля - 96 сек при повному навантаженні.\n"..
    "\n"..
    "\n"..
    "\n",
    "Частина парової машини. Повинна бути заповнена водою. Це можна зробити відром води. Коли води більше немає або температура падає занадто низько\\, парова машина вимикається. Під час роботи парової машини частина води втрачається у вигляді пари при кожному ході поршня\\, тому воду необхідно регулярно доливати.\n"..
    "\n"..
    "\n"..
    "\n",
    "Частина парової машини.\n"..
    "\n"..
    "\n"..
    "\n",
    "Приводна частина парової машини. Маховик повинен бути з'єднаний з машинами через ведучі осі.\n"..
    "\n"..
    "\n"..
    "\n",
    "Частина парової машини. Котел повинен бути з'єднаний з циліндром через парові труби. Парова труба не має відгалужень\\, максимальна довжина - 12 м (блоків).\n"..
    "\n"..
    "\n"..
    "\n",
    "Приводні вали використовуються для передачі енергії від парової машини до інших машин. Максимальна довжина приводного вала становить 10 блоків. За допомогою редукторів TA2 можна долати більші відстані\\, робити відгалуження та змінювати напрямок руху.\n"..
    "\n"..
    "\n"..
    "\n",
    "Електрогенератор TA2 необхідний для роботи ламп або інших споживачів електричної енергії від парової машини. Електрогенератор TA2 повинен бути підключений до ведучих осей з одного боку\\, а потім подавати електрику на інший бік.\n"..
    "\n"..
    "Якщо на електрогенератор не подається достатня кількість енергії\\, він переходить у стан помилки і повинен бути знову активований клацанням правою кнопкою миші.\n"..
    "\n"..
    "Електрогенератор приймає до 25 ku енергії від осі та видає на інший бік до 24 ku у вигляді електроенергії. Таким чином\\, він споживає один ku для перетворення.\n"..
    "\n"..
    "\n"..
    "\n",
    "Для великих систем з кількома паровими машинами або великою кількістю приводних машин рекомендується використовувати систему накопичення енергії. Накопичувач енергії в TA2 працює на потенційній енергії. Для цього баласт (каміння\\, гравій\\, пісок) піднімається за допомогою тросової лебідки. При надлишку механічної енергії в мережі вантаж підтягується вгору. Якщо в короткостроковій перспективі потрібно більше енергії\\, ніж може дати парова машина\\, накопичувач енергії вивільняє накопичену енергію\\, і вантаж опускається вниз.\n"..
    "Накопичувач енергії складається з декількох блоків і повинен бути зібраний\\, як показано на плані праворуч. \n"..
    "Щоб досягти максимальної місткості\\, скриня повинна бути повністю заповнена вантажами\\, а висота щогли з двома коробками передач повинна становити 12 блоків. Можливі й більш компактні конструкції.\n"..
    "\n"..
    "\n"..
    "\n",
    "Тросова лебідка повинна бути з'єднана з коробкою передач і може поглинати надлишкову енергію і таким чином тягти вантаж вгору. \n"..
    "При збиранні лебідки переконайтеся\\, що стрілка на верхній частині блоку спрямована на коробку передач.\n"..
    "Максимальна довжина троса становить 10 блоків. \n"..
    "\n"..
    "\n"..
    "\n",
    "Цей ящик повинен бути встановлений під лебідкою на відстані до 10 блоків і заповнений булижником\\, гравієм або піском. Якщо мінімальна вага стосу (99+ предметів) досягнута і є надлишок енергії\\, ящик автоматично підключається до лебідки за допомогою мотузки і підтягується вгору. \n"..
    "\n"..
    "\n"..
    "\n",
    "За допомогою муфти зчеплення осі та машини можуть бути відокремлені від накопичувача енергії. Це означає\\, що осі після зчеплення зупиняються\\, а системи машин можуть бути зупинені. При збиранні муфти переконайтеся\\, що стрілка на верхній частині блоку спрямована на систему накопичення енергії.\n"..
    "\n"..
    "\n"..
    "\n",
    "Для транспортування предметів від однієї станції обробки до іншої використовуються штовхачі та труби. Див. план.\n"..
    "\n"..
    "\n"..
    "\n",
    "Дві машини можуть бути з'єднані за допомогою штовхача і труби. Труби не мають відгалужень. Максимальна довжина - 200 м (блоків).\n"..
    "Крім того\\, труби можна розміщувати за допомогою клавіші Shift. Це дозволяє\\, наприклад\\, прокладати труби паралельно\\, не допускаючи їх випадкового з'єднання.\n"..
    "Пропускна здатність труби необмежена і обмежується лише штовхачем.\n"..
    "\n"..
    "\n"..
    "\n",
    "Кілька труб можна об'єднати в одну за допомогою концентратора. Напрямок\\, у якому передаються всі предмети\\, позначений стрілкою.\n"..
    "\n"..
    "\n"..
    "\n",
    "Штовхач може витягувати предмети з ящиків або машин і заштовхувати їх в інші ящики або машини. Іншими словами\\, між двома блоками з інвентарем повинен бути один і тільки один штовхач. Кілька штовхачів поспіль не працюють.\n"..
    "\n"..
    "У протилежному напрямку\\, однак\\, штовхач проникний для предметів\\, так що ящик може бути заповнений через трубку\\, а також налаштований.\n"..
    "\n"..
    "Штовхач переходить у стан «очікування»\\, якщо у нього немає предметів для штовхання. Якщо вихід заблокований або інвентар отримувача переповнений\\, штовхач переходить у стан «заблоковано». Якщо ситуація змінилася\\, штовхач автоматично виходить з обох станів через кілька секунд.\n"..
    "\n"..
    "Потужність обробки штовхача TA2 становить 2 предмети кожні 2 с.\n"..
    "\n"..
    "\n"..
    "\n",
    "Розподільник може переміщувати предмети зі свого інвентарю\\, відсортовані у чотирьох напрямках. Для цього розподільник повинен бути налаштований відповідним чином.\n"..
    "\n"..
    "Розподільник має меню з 4 фільтрами різного кольору\\, що відповідають 4 виходам. Якщо якийсь вихід буде використовуватися\\, відповідний фільтр повинен бути активований за допомогою прапорця «увімкнено». Всі елементи\\, сконфігуровані для цього фільтра\\, будуть виводитися через призначений вихід. Якщо фільтр активований без налаштованих елементів\\, йдеться про «неналаштований»\\, відкритий вихід.\n"..
    "\n"..
    "**Увага: Розподільник також є штовхачем на своїх вихідних сторонах. Тому ніколи не витягуйте предмети з розподільника за допомогою штовхача!\n"..
    "\n"..
    "Для неналаштованого виходу існує два режими роботи:\n"..
    "\n"..
    "1) Виводяться всі предмети\\, які не можуть бути виведені на жоден інший вихід\\, навіть якщо вони заблоковані.\n"..
    "\n"..
    "2) Виводити лише ті предмети\\, які не були налаштовані на жоден інший фільтр.\n"..
    "\n"..
    "У першому випадку всі елементи завжди пересилаються\\, і розподільник не переповнюється. У другому випадку елементи затримуються\\, і розподільник може бути переповнений\\, а потім заблокований.\n"..
    "\n"..
    "Режим роботи можна встановити за допомогою прапорця «Режим блокування».\n"..
    "\n"..
    "Потужність обробки розподільника TA2 становить 4 елементи кожні 2 с\\, при цьому розподільник намагається розподілити 4 елементи по відкритих виходах.\n"..
    "\n"..
    "Якщо один і той самий елемент конфігурується декілька разів в одному фільтрі\\, коефіцієнт розподілу буде відповідати у довгостроковій перспективі.\n"..
    "\n"..
    "Зверніть увагу\\, що розподілення є ймовірнісним процесом. Це означає\\, що співвідношення розподілів не буде збігатися точно\\, а лише в довгостроковій перспективі.\n"..
    "\n"..
    "Максимальний розмір стеку у фільтрах - 12\\; всього можна налаштувати не більше 36 елементів\n"..
    "\n"..
    "\n"..
    "\n",
    "Промивання гравію - це більш складна машина\\, мета якої - намити самородки усмію з просіяного гравію. Для встановлення потрібен TA2 Промивач з механічним приводом\\, вирва\\, ємність та проточна вода.\n"..
    "\n"..
    "Структура зліва направо (див. також план):\n"..
    "\n"..
    "  - блок землі\\, на ньому джерело води\\, оточене з трьох сторін\\, наприклад\\, скляними блоками\n"..
    "  - поруч з ним промивач для гравію\\, за потреби з трубами для подачі та видалення гравію\n"..
    "  - потім бункер зі скринею.\n"..
    "\n"..
    "Все це оточене скляними блоками\\, щоб вода стікала по промивачу до вирви\\, а промиті самородки могли бути зібрані бункером.\n"..
    "\n"..
    "\n"..
    "\n",
    "Гравійний промивач здатний промивати усмієву та мідну руди з гравію\\, який уже був просіяний\\, за умови\\, що він покритий водою.\n"..
    "\n"..
    "Правильність роботи гравіопромивача можна перевірити за допомогою паличок\\, якщо помістити їх в інвентар промивача. Їх потрібно класти окремо і виловлювати з вирви.\n"..
    "\n"..
    "Продуктивність становить один предмет гравію кожні 2 с. Гравіємийці потрібно 3 кю енергії.\n"..
    "\n"..
    "\n"..
    "\n",
    "Дроблення\\, подрібнення та просіювання булижника використовується для видобутку руд. Просіяний гравій можна використовувати і для інших цілей. Кар'єр\\, подрібнювач та сито повинні бути приводними\\, тому їх встановлюють поруч із паровою машиною.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Кар'єр використовується для видобутку каменю та інших матеріалів з-під землі. Кар'єр викопує яму розміром 5x5 блоків. Глибину можна регулювати.\n"..
    "Продуктивність становить один блок кожні 4 с. Кар'єру потрібно 10 ku енергії. Максимальна глибина - 20 метрів. Для більшої глибини дивіться TA3 / TA4.\n"..
    "\n"..
    "\n"..
    "\n",
    "Подрібнювач здатний перемелювати різне каміння\\, а також дерево та інші предмети.\n"..
    "Продуктивність становить один предмет кожні 4 с. Подрібнювачу потрібно 4 ku енергії.\n"..
    "\n"..
    "\n"..
    "\n",
    "Просіювач здатний просіювати гравій для видобутку руди. В результаті виходить гравій та просіяний гравій\\, який не можна просіяти знову.\n"..
    "Продуктивність становить один предмет кожні 4 с. Сіялка гравію потребує 3 ku енергії.\n"..
    "\n"..
    "\n"..
    "\n",
    "Машини TA2 можуть не тільки видобувати руду\\, але й виробляти предмети.\n"..
    "\n",
    "Автокрафтер використовується для автоматичного виробництва предметів. Все\\, що гравець може виробити через «вікно крафту»\\, може зробити і автокрафтер. Для цього потрібно ввести рецепт у меню автокрафтера і додати необхідні інгредієнти.\n"..
    "\n"..
    "Інгредієнти та виготовлені предмети можна переміщувати в блок і з нього за допомогою труб і штовхачів.\n"..
    "\n"..
    "Продуктивність становить один предмет кожні 4 с. Автокрафтер потребує 4 ku енергії.\n"..
    "\n"..
    "\n"..
    "\n",
    "Фабрика електроніки - це спеціальна машина\\, яка може бути використана лише для виробництва радіоламп. Радіолампи потрібні для машин та блоків TA3.\n"..
    "\n"..
    "Потужність обробки становить одну радіолампу кожні 6 с. Фабриці електроніки потрібно 8 ku енергії.\n"..
    "\n"..
    "\n"..
    "\n",
    "",
    "Для деяких рецептів потрібна вода. Щоб ці рецепти можна було обробляти автоматично за допомогою автокрафтера\\, вода повинна подаватися у відрах. Для цього використовується наповнювач рідини. Йому потрібні порожні відра\\, які він наповнить водою.\n"..
    "\n"..
    "Продуктивність обробки - одне відро води кожні 8 с. Наповнювачу рідини потрібно 3 ku енергії.\n"..
    "\n"..
    "\n"..
    "\n",
    "Захищена скриня може бути використана лише гравцями\\, які можуть будувати в цьому місці\\, тобто мають право доступу на захищеній території. При цьому не має значення\\, хто встановлює скриню.\n"..
    "\n"..
    "\n"..
    "\n",
    "Minetest ділить карту на так звані блоки карти. Це куби з довжиною грані 16x16x16 блоків. Такий блок карти завжди завантажується сервером повністю\\, але завантажуються лише блоки навколо гравця (приблизно 2-3 блоки в усіх напрямках). У напрямку погляду гравця більше блоків карти. Тільки ця частина світу активна\\, і тільки тут ростуть рослини і дерева або працюють машини.\n"..
    "\n"..
    "За допомогою блоку завантаження карти (forceload) ви можете змусити блок карти\\, в якому знаходиться блок завантаження\\, залишатися завантаженим доти\\, доки ви перебуваєте на сервері. Коли всі ваші ферми і машини покриті блоками завантаження\\, все завжди працює.\n"..
    "\n"..
    "Блоки карти з їхніми координатами визначені заздалегідь\\, наприклад (0\\,0\\,0) - (15\\,15\\,15)\\, або (16\\,16\\,16) - (31\\,31\\,31).\n"..
    "Ви можете переміщувати блок завантаження карти всередині блоку карти як завгодно\\, положення блоку карти залишається незмінним.\n"..
    "\n"..
    "\n"..
    "\n",
  },
  images = {
    "techage_ta2",
    "",
    "ta2_firebox",
    "ta2_boiler",
    "ta2_cylinder",
    "ta2_flywheel",
    "ta2_steampipe",
    "ta2_driveaxle",
    "ta2_generator",
    "",
    "ta2_winch",
    "ta2_weight_chest",
    "techage:ta2_clutch_off",
    "",
    "tube",
    "concentrator",
    "ta2_pusher",
    "ta2_distributor",
    "",
    "ta2_rinser",
    "ta2_grinder",
    "ta2_quarry",
    "ta2_grinder",
    "ta2_gravelsieve",
    "",
    "ta2_autocrafter",
    "ta2_electronicfab",
    "",
    "ta2_liquidsampler",
    "ta2_chest",
    "ta2_forceload",
  },
  plans = {
    "",
    "steamengine",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "ta2_storage",
    "",
    "",
    "",
    "itemtransport",
    "",
    "",
    "",
    "",
    "gravelrinser",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
  }
}
