return {
  titles = {
    "1,Tech Age мод",
    "2,Підказки",
    "2,Зміни порівняно з версією 1.0",
    "3,Поради щодо оновлення версії",
    "2,Руди та мінерали",
    "3,Меридій",
    "3,Усмій",
    "3,Баборій",
    "3,Нафта",
    "3,Боксит",
    "3,Базальт",
    "2,Історія оновлень",
  },
  texts = {
    "Tech Age - це технологічний мод з 5 стадіями розвитку:\n"..
    "\n"..
    "TA1: Залізна доба\n"..
    "Використовуйте інструменти та пристосування\\, такі як вугільні печі\\, гравійні сита\\, молоти та бункери\\, щоб видобувати та обробляти необхідні руди й метали.\n"..
    "\n"..
    "TA2: Парова доба\n"..
    "Побудуйте паровий двигун з механічним приводом і використовуйте його для роботи своїх перших машин з переробки руди.\n"..
    "\n"..
    "TA3: Нафтова доба\n"..
    "Знайдіть та видобувайте нафту\\, побудуйте залізниці для транспортування нафти. Електростанція дає необхідну електрику для ваших машин. Електричне світло освітлює ваші промислові підприємства.\n"..
    "\n"..
    "TA4: Теперішній час\n"..
    "Відновлювані джерела енергії\\, такі як вітер\\, сонце та біопаливо\\, допомагають вам залишити нафтову добу. За допомогою сучасних технологій та розумних машин ви вирушаєте у майбутнє.\n"..
    "\n"..
    "TA5: Майбутнє\n"..
    "Машини\\, що долають простір і час\\, нові джерела енергії та інші досягнення визначають ваше життя.\n"..
    "\n"..
    "Примітка: Натиснувши на знак \"плюс\"\\, ви потрапляєте до підрозділів цього посібника.\n"..
    "\n"..
    "\n"..
    "\n",
    "Ця документація доступна як \"в грі\" (план будівництва блоків)\\, так і на GitHub у вигляді MD-файлів.\n"..
    "\n"..
    "  - Посилання: https://github.com/joe7575/techage/wiki\n"..
    "\n"..
    "Будівельні плани (схеми) для побудови машин та зображення доступні лише в грі.\n"..
    "\n"..
    "У Tech Age вам доведеться починати все спочатку. Ви можете створювати блоки TA2 лише за допомогою предметів з TA1\\, для TA3 вам потрібні результати з TA2 і т.д.\n"..
    "\n"..
    "У TA2 машини працюють лише з привідними осями.\n"..
    "\n"..
    "У TA3 машини працюють від електрики та мають комунікаційний інтерфейс для дистанційного керування.\n"..
    "\n"..
    "TA4 додає більше джерел енергії\\, але також і складніші логістичні завдання (лінії електропередач\\, транспортування виробів).\n"..
    "\n",
    "З версії 1.0 (17.07.2021) змінилося наступне:\n"..
    "\n"..
    "  - Змінився алгоритм розрахунку розподілу енергії. Це робить системи зберігання енергії важливішими. Вони компенсують коливання\\, що важливо для великих мереж з кількома генераторами.\n"..
    "  - З цієї причини TA2 отримала власний накопичувач енергії.\n"..
    "  - Акумуляторні блоки з TA3 також слугують накопичувачами енергії. Їхню функціональність було відповідно адаптовано.\n"..
    "  - Систему зберігання TA4 було переглянуто. Теплообмінник отримав новий номер\\, оскільки його функціональність було перенесено з нижнього блоку на середній. Якщо вони керувалися дистанційно\\, номер вузла потрібно адаптувати. Генератори більше не мають власного меню\\, а вмикаються/вимикаються лише через теплообмінник. Теплообмінник і генератор тепер повинні бути підключені до однієї мережі!\n"..
    "  - Декілька електромереж тепер можуть бути з'єднані через трансформаторні блоки TA4.\n"..
    "  - Також з'явився блок лічильників електроенергії TA4 для підмереж.\n"..
    "  - Щонайменше один блок акумуляторів або система зберігання в кожній мережі\n"..
    "\n",
    "Багато інших блоків отримали незначні зміни. Тому можливо\\, що машини або системи не запустяться одразу після оновлення версії. У разі неполадок допоможуть такі поради:\n"..
    "\n"..
    "  - вимкніть і знову увімкніть машини\n"..
    "  - зніміть блок силових кабелів і встановіть його на місце\n"..
    "  - повністю зніміть блок і встановіть його на місце\n"..
    "\n",
    "Techage додає до гри кілька нових предметів:\n"..
    "\n"..
    "  - Меридій - сплав для виробництва світних інструментів у TA1\n"..
    "  - Усмій - руда\\, яка видобувається в TA2 і необхідна для TA3\n"..
    "  - Баборіум - метал\\, необхідний для рецептів у TA3\n"..
    "  - Нафта - необхідна в TA3\n"..
    "  - Боксит - алюмінієва руда\\, яка необхідна в TA4 для виробництва алюмінію\n"..
    "  - Базальт - виникає при контакті води й лави\n"..
    "\n",
    "Меридій - це сплав сталі та кристалів мезекону. Зливки меридію можна виготовити за допомогою вугільної горілки зі сталі та кристалів мезекону. Меридій світиться в темряві. Інструменти з меридію також світяться і тому дуже корисні при підземному видобутку.\n"..
    "\n"..
    "\n"..
    "\n",
    "Усмій зустрічається лише у вигляді самородків і може бути отриманий тільки під час промивання гравію за допомогою системи промивання гравію TA2/TA3.\n"..
    "\n"..
    "\n"..
    "\n",
    "Баборій можна отримати лише при підземному видобутку. Цю речовину можна знайти тільки на глибині від -250 до -340 метрів.\n"..
    "\n"..
    "Баборіум можна переплавити лише в промисловій печі TA3.\n"..
    "\n"..
    "\n"..
    "\n",
    "Нафту можна знайти лише за допомогою Дослідника і видобути за допомогою відповідних машин TA3. Див. TA3.\n"..
    "\n"..
    "\n"..
    "\n",
    "Боксит можна видобути лише в підземній шахті. Боксит можна знайти тільки в камені на висоті від -50 до -500 метрів.\n"..
    "Він необхідний для виробництва алюмінію\\, який здебільшого використовується в TA4.\n"..
    "\n"..
    "\n"..
    "\n",
    "Базальт утворюється лише при поєднанні лави та води.\n"..
    "Найкраще створити систему\\, в якій лава і вода будуть текти разом.\n"..
    "Базальт утворюється там\\, де зустрічаються обидві рідини.\n"..
    "Ви можете створити автоматичний генератор базальту за допомогою Sign Bot.\n"..
    "\n"..
    "\n"..
    "\n",
    "  - 28.09.2019: Solar system added\n"..
    "  - 05.10.2019: Data on the solar system and description of the inverter and the power terminal changed\n"..
    "  - 18.11.2019: Chapter for ores\\, reactor\\, aluminum\\, silo\\, bauxite\\, furnace heating\\, gravel washing system added\n"..
    "  - 22.02.2020: corrections and chapters on the update\n"..
    "  - 29.02.2020: ICTA controller added and further corrections\n"..
    "  - 14.03.2020 Lua controller added and further corrections\n"..
    "  - 22.03.2020 More TA4 blocks added\n"..
    "\n",
  },
  images = {
    "techage_ta4",
    "",
    "",
    "",
    "",
    "meridium",
    "usmium",
    "baborium",
    "oil",
    "bauxite",
    "basalt",
    "",
  },
  plans = {
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
  }
}
