return {
  titles = {
    "1,TA3: Нафтова доба",
    "2,Вугільна електростанція / Нафтова електростанція",
    "3,TA3 Вугільна топка електростанції",
    "3,TA3 Нафтова топка електростанції",
    "3,TA3 Котел",
    "3,TA3 Турбіна",
    "3,TA3 Генератор",
    "3,TA3 Охолоджувач",
    "2,Електричний струм",
    "3,Важливість систем накопичення енергії",
    "3,TA Електричний кабель",
    "3,TA Електросполучувач",
    "3,TA Лінія електропередачі",
    "3,TA Стовп",
    "3,TA Верхівка стовпа",
    "3,TA Верхівка стовпа 2",
    "3,ТА Вимикач",
    "3,TA Вимикач міні",
    "3,TA Коробка вимикача",
    "3,TA3 Портативний генератор",
    "3,TA3 Акумулятор",
    "3,TA3 Термінал електромережі",
    "3,TA3 Електродвигун",
    "2,TA3 Промислова піч",
    "3,TA3 Нафтовий пальник",
    "3,TA3 Верхня частина печі",
    "3,TA3 Нагнітач",
    "2,Рідини",
    "3,TA3 Резервуар",
    "3,TA3 Насос",
    "3,TA Наливний пристрій",
    "3,TA3 Труба",
    "3,TA3 Труба в стіні",
    "3,TA Вентиль",
    "2,Видобуток нафти",
    "3,TA3 Нафтовий сонар",
    "3,TA3 Бурова установка",
    "3,TA3 Нафтокачка",
    "3,TA3 Бурильна труба",
    "3,Нафтовий резервуар",
    "2,Транспортування нафти",
    "3,Транспортування нафти вагонетками",
    "3,Транспортування нафти за допомогою бочок порівняно з Minecarts",
    "3,Вагонетка-цистерна",
    "3,Вагонетка-скриня",
    "2,Переробка нафти",
    "3,Дистиляційна колона",
    "4,Нафтовий нагрівач",
    "2,Логічні/комутаційні блоки",
    "3,TA3 Кнопка / перемикач",
    "3,TA3 Перетворювач команд",
    "3,TA3 Тригер",
    "3,TA3 Логічний блок",
    "3,TA3 Повторювач",
    "3,TA3 Секвенсор",
    "3,TA3 Таймер",
    "3,TA3 Термінал",
    "3,TechAge Кольорова лампа",
    "3,Блоки дверей і воріт",
    "3,TA3 Контролер дверей",
    "3,TA3 Контролер дверей II",
    "3,TA3 Звуковий блок",
    "3,TA3 Перетворювач Mesecons",
    "2,Детектори",
    "3,TA3 Детектор предметів",
    "3,TA3 Детектор вагонетки",
    "3,TA3 Детектор блоків",
    "3,TA3 Детектор гравців",
    "3,TA3 Детектор світла",
    "2,TA3 Машини",
    "3,TA3 Штовхач",
    "3,TA3 Розподільник",
    "3,TA3 Автокрафтер",
    "3,TA3 Фабрика електроніки",
    "3,TA3 Кар'єр",
    "3,TA3 Просіювач",
    "3,TA3 Промивач",
    "3,TA3 Подрібнювач",
    "3,TA3 Інжектор",
    "2,Інструменти",
    "3,TechAge Гайковий ключ",
    "3,TechAge Програматор",
    "3,TechAge Кельма",
    "3,TA3 Ключ для бурильних труб",
    "3,TechAge Викрутка",
    "3,TechAge Інструмент для збирання",
  },
  texts = {
    "У TA3 важливо замінити машини з паровою машиною на потужніші машини з електричним двигуном.\n"..
    "\n"..
    "Для цього вам доведеться побудувати електростанції та генератори\\, що працюють на вугіллі. Незабаром ви побачите\\, що ваші потреби в електриці можна задовольнити лише за допомогою електростанцій\\, що працюють на нафті. Тому вам треба вирушати на пошуки нафти. Бурові вишки та нафтові насоси допомагають видобувати нафту. Для транспортування нафти до електростанції(й) використовуються залізниці.\n"..
    "\n"..
    "Індустріальна епоха досягла свого піку.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Вугільна електростанція складається з декількох блоків і повинна бути зібрана\\, як показано на плані праворуч. Для цього потрібні блоки: TA3 \"Топка електростанції\"\\, TA3 \"Верх котла\"\\, TA3 \"Основа котла\"\\, TA3 \"Турбіна\"\\, TA3 \"Генератор\" та TA3 \"Охолоджувач\".\n"..
    "\n"..
    "Котел повинен бути заповнений водою. Залити в котел можна до 10 відер води.\n"..
    "Топковий ящик повинен бути заповнений вугіллям або деревним вугіллям.\n"..
    "Коли вода нагріється\\, запускається генератор.\n"..
    "\n"..
    "Як альтернатива\\, електростанція може бути оснащена нафтовим пальником і працювати на нафтопродуктах.\n"..
    "Нафту та нафтопродукти можна доливати за допомогою насоса і труб.\n"..
    "\n"..
    "Потужність електростанції становить 80 ku.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Частина електростанції.\n"..
    "У топку необхідно засипати вугілля або деревне вугілля. Час горіння залежить від потужності\\, яку запитує електростанція. Вугілля горить 20 с\\, а деревне вугілля - 60 с при повному навантаженні. Відповідно довше при частковому навантаженні (50% навантаження = збільшення тривалості горіння вдвічі).\n"..
    "\n"..
    "\n"..
    "\n",
    "Частина електростанції.\n"..
    "\n"..
    "У нафтову топку можна заливати сиру нафту\\, мазут\\, нафту (лігроїн) або бензин. Час горіння залежить від потужності\\, яку запитує електростанція. При повному навантаженні сира нафта горить 15 с\\, мазут - 20 с\\, лігроїн - 22 с\\, а бензин - 25 с.\n"..
    "\n"..
    "Відповідно довше при частковому навантаженні (50% навантаження = збільшення тривалості горіння вдвічі).\n"..
    "\n"..
    "Нафтовий пальник вміщує лише 50 одиниць палива. Тому доцільно встановити додатковий бак для мастила і насос.\n"..
    "\n"..
    "\n"..
    "\n",
    "Частина електростанції. Повинен бути заповнений водою. Якщо води більше немає або температура падає занадто низько\\, електростанція вимикається.\n"..
    "\n"..
    "Витрата води в котлі TA3 значно нижча\\, ніж у паровій машині\\, завдяки замкнутому паровому контуру.\n"..
    "У паровій машині частина води втрачається у вигляді пари при кожному ході поршня.\n"..
    "\n"..
    "\n"..
    "\n",
    "Турбіна є частиною електростанції. Вона повинна бути розташована поруч із генератором і з'єднана з котлом та охолоджувачем через парові труби\\, як показано на плані.\n"..
    "\n"..
    "\n"..
    "\n",
    "Генератор використовується для вироблення електроенергії. Він повинен бути підключений до машин за допомогою силових кабелів і розподільних коробок.\n"..
    "\n"..
    "\n"..
    "\n",
    "Використовується для охолодження гарячої пари з турбіни. Повинен бути підключений до котла і турбіни через парові труби\\, як показано на плані.\n"..
    "\n"..
    ".\n"..
    "\n",
    "У TA3 (і TA4) машини живляться від електрики. Для цього машини\\, системи накопичення енергії та генератори повинні бути з'єднані силовими кабелями.\n"..
    "TA3 має 2 типи силових кабелів:\n"..
    "\n"..
    "  - Ізольовані кабелі (силові кабелі TA) для локальної проводки в підлозі або в будівлях. Ці кабелі можуть бути приховані в стіні або в підлозі (можуть бути \"заштукатурені\" за допомогою кельми).\n"..
    "  - Наземні лінії (лінія електропередачі TA) для прокладання кабелів поза приміщеннями на великі відстані. Ці кабелі захищені і не можуть бути зламані іншими гравцями.\n"..
    "\n"..
    "Кілька споживачів\\, систем накопичення енергії та генераторів можуть працювати разом в електричній мережі. Мережі можна створювати за допомогою розподільних коробок.\n"..
    "Якщо електрики буде занадто мало\\, споживачі зупиняться.\n"..
    "У цьому контексті також важливо розуміти функціональність блоків завантаження карти\\, оскільки\\, наприклад\\, генератори подають електрику лише тоді\\, коли завантажений відповідний блок карти. Це можна забезпечити за допомогою блоку завантаження карти (Forceload).\n"..
    "\n"..
    "У TA4 також є низьковольтний кабель для сонячної системи.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Системи накопичення енергії в енергосистемі виконують два завдання:\n"..
    "\n"..
    "  - Щоб справлятися з піками попиту: Всі генератори завжди видають рівно стільки енергії\\, скільки потрібно. Однак при вмиканні/вимиканні споживачів або при коливаннях попиту з інших причин споживачі можуть на короткий час вийти з ладу. Щоб запобігти цьому\\, у кожній мережі завжди повинен бути хоча б один акумуляторний блок. Він слугує буфером і компенсує ці коливання в діапазоні секунд.\n"..
    "  - Для накопичення відновлюваної енергії: Сонячна і вітрова енергія недоступна 24 години на добу. Щоб не допустити перебоїв у подачі електроенергії\\, коли вона не виробляється\\, у мережі потрібно встановити одну або кілька систем накопичення енергії. Як альтернатива\\, прогалини можна заповнити за рахунок електроенергії\\, отриманої з нафти або вугілля.\n"..
    "\n"..
    "Система накопичення енергії вказує свою ємність у kud\\, тобто в ku за день. Наприклад\\, система зберігання з ємністю 100 kud забезпечує 100 ku протягом одного ігрового дня або 10 ku протягом 10 ігрових днів.\n"..
    "\n"..
    "Усі джерела енергії TA3/TA4 мають регульовані характеристики заряджання. За замовчуванням вона встановлена на \"80 % - 100 %\". Це означає\\, що коли система зберігання заповнена на 80 %\\, потужність знижується все більше і більше\\, поки не вимкнеться повністю на 100 %. Якщо в мережі потрібна електроенергія\\, 100% ніколи не буде досягнуто\\, оскільки потужність генератора в якийсь момент знизиться до рівня потреби в електроенергії в мережі\\, і система зберігання більше не буде заряджатися\\, а обслуговуватимуться лише споживачі.\n"..
    "\n"..
    "Це має ряд переваг:\n"..
    "\n"..
    "  - Характеристики заряджання можна регулювати. Це означає\\, що\\, наприклад\\, витрата нафти/вугілля може бути знижена на 60 %\\, а регенеративних джерел енергії - лише на 80 %. Це означає\\, що нафта/вугілля спалюється лише в тому випадку\\, якщо не вистачає відновлюваних джерел енергії.\n"..
    "  - Кілька джерел енергії можуть працювати паралельно і бути завантажені практично рівномірно\\, оскільки всі джерела енергії працюють\\, наприклад\\, до 80% зарядної ємності системи зберігання на повну потужність\\, а потім одночасно знижують свою потужність.\n"..
    "  - Всі системи зберігання в мережі утворюють великий буфер. Зарядну ємність і рівень заповнення всієї системи зберігання завжди можна зчитати у відсотках на кожній системі зберігання\\, а також на терміналі електроенергії.\n"..
    "\n"..
    "\n"..
    "\n",
    "Для локальної електропроводки в підлозі або в стінах будівель.\n"..
    "Розгалуження можуть бути реалізовані за допомогою розподільних коробок. Максимальна довжина кабелю між машинами або розподільними коробками становить 1000 м. У силову мережу можна підключити не більше 1000 вузлів. Всі блоки з силовим підключенням\\, включно з розподільними коробками\\, вважаються вузлами.\n"..
    "\n"..
    "Оскільки силові кабелі не мають автоматичного захисту\\, для великих відстаней рекомендується використовувати наземні лінії (лінія електропередачі TA).\n"..
    "\n"..
    "Силові кабелі можна заштукатурити за допомогою кельми\\, щоб сховати їх у стіні або в підлозі. Як штукатурний матеріал можна використовувати будь-які кам'яні\\, глиняні та інші блоки\\, що не мають \"інтелекту\". Земля не підходить\\, тому що земля може перетворитися на траву і подібне\\, що зруйнує лінію.\n"..
    "\n"..
    "Для нанесення штукатурки потрібно клацнути на кабель кельмою. Матеріал\\, яким буде заштукатурений кабель\\, повинен знаходитися зліва в швидких слотах гравця.\n"..
    "Кабелі можна знову зробити видимими\\, натиснувши на блок з лопаткою.\n"..
    "\n"..
    "Крім кабелів\\, можна також заштукатурити TA Електросполучувач та TA коробку вимикача електроживлення.\n"..
    "\n"..
    ".\n"..
    "\n",
    "За допомогою сполучувача можна розподілити електрику в 6 напрямках. Сполучувачі також можна заштукатурити (сховати) за допомогою кельми і знову зробити видимими.\n"..
    "\n"..
    ".\n"..
    "\n",
    "За допомогою TA лінії електропередачі та електричних стовпів можна реалізувати досить реалістичні повітряні лінії. Опори стовпів також слугують для захисту лінії електропередачі (захист). Стовпи повинні бути встановлені через кожні 16 м або менше. Захист поширюється лише на лінію електропередачі та стовпи\\, однак всі інші блоки в цій області не захищені.\n"..
    "\n"..
    "\n"..
    "\n",
    "Використовується для будівництва стовпів електропередач. Захищений від руйнування верхівкою стовпа і може бути прибраний лише власником.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Має до чотирьох кріплень проводу\\, що дозволяє розподіляти електрику в 6 напрямках.\n"..
    "верхівка для стовпів захищає лінії електропередач і стовпи в радіусі 8 м.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Ця верхівка електричного стовпа має два фіксовані кріплення проводу і використовується для повітряних ліній. Однак вона також може передавати струм вниз і вгору.\n"..
    "верхівка для стовпів захищає лінії електропередач і стовпи в радіусі 8 м.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Вимикач можна використовувати для вмикання і вимикання живлення. Для цього вимикач повинен бути встановлений на коробці вимикача живлення. Коробка силового вимикача повинна бути підключена до силового кабелю з обох сторін.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Перемикач можна використовувати для вмикання і вимикання живлення. Для цього перемикач повинен бути встановлений на коробці перемикача живлення. Коробка силового перемикача повинна бути підключена до силового кабелю з обох сторін.\n"..
    "\n"..
    "\n"..
    "\n",
    "див. перемикач живлення TA.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Портативний генератор працює на бензині і може використовуватися для невеликих споживачів потужністю до 12 ku. При повному навантаженні бензин згорає протягом 150 с. Відповідно довше при частковому навантаженні (50% навантаження = збільшення тривалості горіння вдвічі).\n"..
    "\n"..
    "Портативний генератор вміщує лише 50 одиниць бензину. Бажано встановити додатковий бак і насос.\n"..
    "\n"..
    "\n"..
    "\n",
    "Акумулятор використовується для накопичення надлишкової енергії і автоматично подає енергію в разі відключення живлення за її наявності.\n"..
    "Кілька акумуляторів разом утворюють систему зберігання енергії TA3. На кожному блоці є індикатор стану заряджання і накопиченого навантаження.\n"..
    "Тут завжди відображаються значення для всієї мережі. Накопичена енергія відображається в kud або \"ku-днях\" (аналогічно кВт-год). 5 kud відповідає\\, наприклад\\, 5 ku за ігровий день (20 хвилин) або 1 ku за 5 ігрових днів.\n"..
    "\n"..
    "Акумулятор має ємність 3\\,33 kud\n"..
    "\n"..
    ".\n"..
    "\n",
    "Термінал електромережі повинен бути підключений до електромережі. На ньому відображаються дані з електромережі.\n"..
    "\n"..
    "Найважливіші показники відображаються у верхній половині:\n"..
    "\n"..
    "  - струм/максимальна потужність генератора\n"..
    "  - поточне енергоспоживання всіх споживачів\n"..
    "  - поточний зарядний струм в/із системи зберігання\n"..
    "  - Поточний стан заряду системи зберігання у відсотках\n"..
    "\n"..
    "У нижній половині виводиться кількість пристроїв у мережі.\n"..
    "\n"..
    "Додаткові дані про генератори і системи зберігання можна запросити на вкладці \"Консоль\".\n"..
    "\n"..
    ".\n"..
    "\n",
    "Електродвигун TA3 необхідний для того\\, щоб машини TA2 могли працювати від електромережі. Електродвигун TA3 перетворює електрику в потужність осі.\n"..
    "Якщо на електродвигун не подається достатня потужність\\, він переходить у стан несправності і повинен бути знову активований клацанням правою кнопкою миші.\n"..
    "\n"..
    "Електродвигун споживає макс. 40 ku електроенергії і забезпечує макс. 39 ku як потужність осі. Таким чином\\, він витрачає один ku на перетворення.\n"..
    "\n"..
    "\n"..
    "\n",
    "Промислова піч TA3 слугує доповненням до звичайних печей. Це означає\\, що всі товари можна виробляти за рецептами \"варіння\" навіть у промисловій печі. Але є і особливі рецепти\\, які можна отримати тільки з промислової печі.\n"..
    "Промислова піч має власне меню для вибору рецепту. Залежно від того\\, які ресурси знаходяться в інвентарі промислової печі зліва\\, праворуч можна вибрати вихідний продукт.\n"..
    "\n"..
    "Промислова піч потребує електрики (для нагнітача) і мазуту/бензину для пальника. Промислова піч повинна бути зібрана\\, як показано на плані праворуч.\n"..
    "\n"..
    "Див. також нагрівач TA4.\n"..
    "\n"..
    "\n"..
    "\n",
    "Є частиною промислової печі TA3.\n"..
    "\n"..
    "Нафтовий пальник може працювати на сирій нафті\\, мазуті\\, нафті (лігроїні) або бензині. Час горіння становить 64 с для сирої нафти\\, 80 с для мазуту\\, 90 с для лігроїну і 100 с для бензину.\n"..
    "\n"..
    "Нафтовий пальник вміщує лише 50 одиниць палива. Бажано встановити додатковий бак і насос.\n"..
    "\n"..
    "\n"..
    "\n",
    "Є частиною TA3 промислової печі. Див. промислову піч TA3.\n"..
    "\n"..
    "\n"..
    "\n",
    "Є частиною промислової печі TA3. Див. промислову піч TA3.\n"..
    "Слугує для нагнітання повітря в топку.\n"..
    "\n"..
    "\n"..
    "\n",
    "Рідини\\, такі як вода або нафта\\, можна перекачувати лише спеціальними трубами і зберігати в резервуарах. Як і у випадку з водою\\, існують ємності (каністри\\, бочки)\\, в яких рідину можна зберігати і перевозити.\n"..
    "\n"..
    "За допомогою жовтих труб і сполучувачів можна також з'єднати кілька резервуарів. Однак резервуари повинні мати однаковий вміст\\, а між резервуаром\\, насосом і розподільною трубою завжди повинна бути хоча б одна жовта труба.\n"..
    "\n"..
    "Наприклад\\, неможливо підключити два резервуари безпосередньо до розподільної труби.\n"..
    "\n"..
    "Наливний пристрій використовується для переливання рідин з контейнерів у резервуари. На плані показано\\, як каністри або бочки з рідинами за допомогою штовхачів заштовхуються в наливний пристрій. Контейнер спорожняється в наливному пристрої\\, і рідина спускається в резервуар.\n"..
    "\n"..
    "Наливний пристрій також можна помістити під резервуар\\, щоб спорожнити його.\n"..
    "\n"..
    "\n"..
    "\n",
    "Рідини можна зберігати в резервуарі. Резервуар можна наповнити або спорожнити за допомогою насоса. Для цього насос повинен бути підключений до резервуара через трубу (жовті труби).\n"..
    "\n"..
    "Резервуар також можна заповнити або спорожнити вручну\\, клацнувши по ньому з повним або порожнім контейнером для рідини (бочкою\\, каністрою). Слід зазначити\\, що бочки можуть бути заповнені або спорожнені лише повністю. Якщо\\, наприклад\\, у резервуарі залишилося менше 10 одиниць\\, цей залишок потрібно видалити за допомогою каністр або відкачати до порожнечі.\n"..
    "\n"..
    "Цистерна TA3 вміщує 1000 одиниць або 100 бочок рідини.\n"..
    "\n"..
    "\n"..
    "\n",
    "Насос можна використовувати для перекачування рідин з резервуарів або контейнерів в інші резервуари або контейнери. При роботі насоса необхідно дотримуватися напрямку (стрілка). Жовті лінії і сполучувачі також дозволяють встановлювати кілька резервуарів з кожного боку насоса. Однак резервуари повинні мати однаковий вміст.\n"..
    "\n"..
    "Насос TA3 перекачує 4 одиниці рідини кожні дві секунди.\n"..
    "\n"..
    "Примітка 1: Насос не повинен розташовуватися безпосередньо поруч із резервуаром. Між ними завжди повинен бути щонайменше шматок жовтої труби.\n"..
    "\n"..
    "\n"..
    "\n",
    "Наливний пристрій використовується для перекачування рідин між ємностями і резервуарами.\n"..
    "\n"..
    "  - Якщо наливний пристрій знаходиться під резервуаром\\, а порожні бочки поміщаються в наливний пристрій за допомогою штовхача або вручну\\, вміст резервуара переливається в бочки\\, і бочки можна витягти з вихідного отвору.\n"..
    "  - Якщо наливний пристрій встановлений на резервуарі\\, а повні контейнери поміщаються в наливний пристрій за допомогою штовхача або вручну\\, вміст переливається в резервуар\\, а порожні контейнери можуть бути видалені зі сторони виходу\n"..
    "\n"..
    "Слід зазначити\\, що бочки можуть бути заповнені або спорожнені лише повністю. Якщо\\, наприклад\\, у резервуарі залишилося менше 10 одиниць\\, цей залишок потрібно видалити за допомогою каністр або відкачати порожнім насосом.\n"..
    "\n"..
    "\n"..
    "\n",
    "Жовті труби використовуються для передачі газу і рідин.\n"..
    "Максимальна довжина труби - 100 м.\n"..
    "\n"..
    "\n"..
    "\n",
    "Блоки слугують для прихованого проведення в стінах труб.\n"..
    "\n"..
    "\n"..
    "\n",
    "Для жовтих труб передбачений вентиль\\, який можна відкривати і закривати одним клацанням миші.\n"..
    "Керування вентилем також може здійснюватися за допомогою команд вмикання/вимикання (див. TA3 Термінал).\n"..
    "\n"..
    "\n"..
    "\n",
    "Для того щоб генератори і печі працювали на нафті\\, вам потрібно спочатку знайти нафту. А після цього треба побудувати вишку\\, а потім видобути її.\n"..
    "Для цього використовуються TA3 Нафтовий сонар\\, TA3 бурова установка та TA3 Нафтовий насос.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Ви можете шукати нафту за допомогою нафтового сонара. Для цього поставте блок на підлогу/ґрунт/землю і клацніть правою кнопкою миші\\, щоб почати пошук. Нафтовий сонар використовувати як над землею\\, так і під землею на будь-якій глибині.\n"..
    "У чаті відображається інформація про глибину пошуку нафти і кількість знайденої нафти (петролеуму).\n"..
    "Ви можете натискати на блок кілька разів\\, щоб шукати нафту в глибших областях. Розмір нафтових родовищ варіюється від 4 000 до 20 000 одиниць.\n"..
    "\n"..
    "Якщо пошуки не увінчалися успіхом\\, необхідно пересунути блок на 16 м далі.\n"..
    "Нафтовий сонар завжди шукає нафту у всьому блоці карти і нижче\\, в якому він був встановлений. Тому новий пошук у тому самому блоці карти (поле 16x16) не має сенсу.\n"..
    "\n"..
    "Якщо нафту знайдено\\, на екрані з'явиться місце для встановлення бурової вишки. Ви повинні звести бурову вишку в межах зазначеної області\\, найкраще позначити місце знаком і захистити всю територію від сторонніх гравців.\n"..
    "\n"..
    "Не відмовляйтеся від пошуків нафти занадто швидко. Якщо вам не пощастить\\, пошук нафти може зайняти багато часу.\n"..
    "Також не має сенсу шукати нафту в зоні\\, яку вже обшукав інший гравець. Шанс знайти нафту в будь-якому місці однаковий для всіх гравців.\n"..
    "\n"..
    "\n"..
    "\n",
    "Бурова установка повинна бути встановлена в місці\\, вказаному нафторозвідником. Бурити нафту в іншому місці безглуздо.\n"..
    "Якщо натиснути кнопку на коробці з нафтовим буром\\, над нею буде зведена вишка. Це займає кілька секунд.\n"..
    "Бурова установка має 4 сторони\\, в IN подається бурильна труба через штовхач\\, а в OUT вилітає буровий матеріал. Через одну з двох вільних сторін на бурову установку повинно подаватися живлення.\n"..
    "\n"..
    "Бурова установка бурить до нафтового родовища (1 метр за 16 с) і потребує 16 ku електроенергії.\n"..
    "Після досягнення нафтового родовища установка може бути розібрана\\, а блок прибраний.\n"..
    "\n"..
    "\n"..
    "\n",
    "Тепер на місце бурової установки необхідно встановити нафтокачку (pump-jack). нафтокачка також потребує електрику (16 ku) і подає одну одиницю нафти кожні 8 с. Нафта повинна збиратися в резервуар. Для цього потрібно з'єднати нафтокачку з резервуаром за допомогою жовтих труб.\n"..
    "Після того як вся нафта буде викачана\\, можна зняти і саму нафтокачку.\n"..
    "\n"..
    "\n"..
    "\n",
    "Для буріння потрібно стільки труб\\, на яку глибину розраховане нафтове родовище. Після буріння труба стає непотрібною\\, але її також не можна демонтувати\\, і вона залишається в землі. Однак існує інструмент для витягування бурильних труб (-> Інструменти -> TA3 ключ для бурильних труб).\n"..
    "\n"..
    "\n"..
    "\n",
    "Нафтовий резервуар - це велика версія TA3 Резервуара (див. Рідини -> TA3 Резервуар).\n"..
    "\n"..
    "Великий резервуар вміщує 4000 одиниць нафти\\, а також будь-які інші види рідин.\n"..
    "\n"..
    ".\n"..
    "\n",
    "",
    "Вагонетки-цистерни можуть використовуватися для транспортування нафти від нафтової свердловини до нафтопереробного заводу. Вагонетку-цистерну можна наповнювати або спорожняти безпосередньо за допомогою насосів. В обох випадках жовті труби повинні бути приєднані до вагонетки-цистерни зверху.\n"..
    "\n"..
    "Необхідно виконати такі дії:\n"..
    "\n"..
    "  - Встановіть вагонетку-цистерну перед рейковим бамперним блоком. Блок бампера ще не повинен бути запрограмований на час\\, щоб вагонетка-цистерна не запустилася автоматично\n"..
    "  - Підключіть вагонетку з цистерною до насоса за допомогою жовтих труб\n"..
    "  - Увімкніть насос\n"..
    "  - Запрограмуйте бампер на час (10 - 20 с)\n"..
    "\n"..
    "Ця послідовність повинна дотримуватися з обох сторін (накачування / викачування).\n"..
    "\n"..
    "\n"..
    "\n",
    "У Minecart (далі вагонетки) можна завантажувати каністри і бочки. Для цього нафту потрібно спочатку перелити в бочки. Бочки з нафтою можна заштовхувати прямо у вагонетку за допомогою штовхача і труб (див. карту). Порожні бочки\\, які повертаються зі станції розвантаження на вагонетці\\, можна вивантажити за допомогою бункера\\, який встановлюється під рейками на зупинці.\n"..
    "\n"..
    "За допомогою бункера неможливо одночасно *розвантажити порожні бочки і завантажити повні бочки під час зупинки*. Бункер одразу ж вивантажує повні бочки. Тому рекомендується встановити 2 станції на стороні завантаження і розвантаження\\, а потім запрограмувати вагонетку відповідним чином за допомогою прогону запису.\n"..
    "\n"..
    "На плані показано\\, як нафту можна закачати в резервуар\\, наповнити бочки через заливний пристрій і завантажити у вагонетку.\n"..
    "\n"..
    "Щоб вагонетки запускалися знову автоматично\\, на бамперних блоках необхідно вказати назву станції і час очікування. Для розвантаження достатньо 5 с. Однак\\, оскільки штовхачі завжди переходять у режим очікування на кілька секунд за відсутності вагонетки\\, для завантаження необхідно ввести час 15 або більше секунд.\n"..
    "\n"..
    "\n"..
    "\n",
    "Вагонетка-цистерна використовується для перевезення рідин. Як і цистерни\\, її можна наповнювати за допомогою насосів або спорожняти. В обох випадках жовта труба повинна бути приєднана до автоцистерни зверху.\n"..
    "\n"..
    "У вагонетку-цистерну поміщається 200 одиниць.\n"..
    "\n"..
    "\n"..
    "\n",
    "Вагонетка-скриня використовується для перевезення предметів. Як і скрині\\, її можна наповнити або спорожнити за допомогою штовхача.\n"..
    "\n"..
    "4 стоси поміщаються у вагонетку-скриню.\n"..
    "\n"..
    "\n"..
    "\n",
    "Нафта - це суміш речовин\\, що складається з безлічі компонентів. За допомогою перегінної колони нафту можна розділити на основні компоненти\\, такі як бітум\\, мазут\\, нафта (лігроїн)\\, бензин і газ пропан.\n"..
    "Подальша переробка до кінцевих продуктів відбувається в хімічному реакторі.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Дистиляційна колона повинна бути встановлена так\\, як показано на плані у верхньому правому куті.\n"..
    "Бітум зливається через базовий блок. Вихід знаходиться на задній стороні базового блока (зверніть увагу на напрямок стрілки).\n"..
    "Блоки \"перегінної вежі\" з номерами: 1\\, 2\\, 3\\, 2\\, 3\\, 2\\, 3\\, 4 розташовані на цьому основному блоці\n"..
    "Мазут\\, нафта (лігроїн) і бензин витікають з отворів знизу вгору. Газ пропан потрапляє у верхній отвір.\n"..
    "Всі отвори на вежі повинні бути з'єднані з резервуарами.\n"..
    "Нафтовий нагрівач повинен бути підключений до блока \"Дистиляційна колона 1\".\n"..
    "\n"..
    "Нафтовий нагрівач потребує електрику (не показано на плані)!\n"..
    "\n"..
    "\n"..
    "\n",
    "У нафтовому нагрівачі нафта нагрівається приблизно до 400 °С. Вона значною мірою випаровується і надходить у дистиляційну колону для охолодження.\n"..
    "\n"..
    "Нафтовий нагрівач потребує 14 одиниць електроенергії і виробляє одну одиницю бітуму\\, мазуту\\, нафти (лігроїну)\\, бензину і пропану кожні 16 с.\n"..
    "Для цього в нафтовий нагрівач необхідно подавати нафту через насос.\n"..
    "\n"..
    "\n"..
    "\n",
    "Окрім труб для транспортування вантажів\\, а також газо- та електропроводів\\, існує також бездротовий рівень зв'язку\\, за допомогою якого блоки можуть обмінюватися даними один з одним. Для цього не потрібно прокладати лінії\\, зв'язок між передавачем і приймачем здійснюється лише через номер блока.\n"..
    "\n"..
    "*Інформація:* Номер блока - це унікальний номер\\, який генерується модом Techage при розміщенні великої кількості блоків Techage. Номер блока використовується для адресації при обміні даними між контролерами Techage і машинами. Всі блоки\\, які можуть брати участь у цьому спілкуванні\\, показують номер блока у вигляді інформаційного тексту\\, якщо ви фіксуєте блок курсором миші.\n"..
    "\n"..
    "Які команди підтримує той чи інший блок\\, можна дізнатися і відобразити за допомогою TechAge Info Tool (гайковий ключ).\n"..
    "Найпростіші команди\\, що підтримуються майже всіма блоками:\n"..
    "\n"..
    "  - 'on' - вмикати блок / машину / лампу\n"..
    "  - 'off' - вимикати блок / машину / лампу\n"..
    "\n"..
    "За допомогою терміналу TA3 ці команди можна легко випробувати. Припустимо\\, сигнальна лампа має номер 123.\n"..
    "Потім за допомогою:\n"..
    "\n"..
    "    cmd 123 on\n"..
    "\n"..
    "лампу можна вмикати і вимикати:\n"..
    "\n"..
    "    cmd 123 off\n"..
    "\n"..
    "лампа може бути знову вимкнена. Ці команди повинні бути введені в поле вводу терміналу TA3.\n"..
    "\n"..
    "Такі команди\\, як \"on\" і \"off\"\\, надсилаються отримувачу без відповідної реакції. Таким чином\\, ці команди можуть бути надіслані декільком отримувачам одночасно\\, наприклад\\, за допомогою кнопки/перемикача\\, якщо в полі вводу введено кілька цифр.\n"..
    "\n"..
    "Команда типу 'state' запитує статус блока. Потім блок надсилає свій статус назад. Цей тип підтвердженої команди може бути надісланий тільки одному отримувачу одночасно.\n"..
    "Цю команду можна також перевірити\\, наприклад\\, за допомогою клеми TA3 на штовхачі:\n"..
    "\n"..
    "    cmd 123 state\n"..
    "\n"..
    "Можливі відповіді штовхача::\n"..
    "\n"..
    "  - 'running' -> працює\n"..
    "  - 'stopped' -> вимкнений\n"..
    "  - 'standby' -> нічого не робить\\, тому що вихідний інвентар порожній\n"..
    "  - 'blocked' -> не може нічого зробити\\, тому що інвентар цілі переповнений\n"..
    "\n"..
    "Цей статус та інша інформація також виводяться при натисканні гайкового ключа на блок.\n"..
    "\n"..
    "\n"..
    "\n",
    "Кнопка/перемикач надсилає команди 'on' / 'off' на блоки\\, які були сконфігуровані за допомогою цифр.\n"..
    "Кнопка/перемикач може бути налаштована як кнопка або перемикач. Якщо вона сконфігурована як кнопка\\, можна встановити час між командами 'on' і 'off'. У режимі роботи \"button\" (кнопка) передається лише команда 'on' і не передається команда 'off'.\n"..
    "\n"..
    "За допомогою прапорця \"public\" можна встановити\\, чи може кнопка використовуватися всіма (встановлено) або лише самим власником (не встановлено).\n"..
    "\n"..
    "Примітка: За допомогою програматора можна легко збирати і налаштовувати номери блоків.\n"..
    "\n"..
    "\n"..
    "\n",
    "За допомогою конвертера команд TA3 команди 'on' / 'off' можуть бути перетворені в інші команди\\, а переадресація може бути запобігнута або відкладена.\n"..
    "Необхідно ввести номер цільового блока або номери цільових блоків\\, команди для надсилання і час затримки в секундах. Якщо команда не введена\\, нічого не буде надіслано.\n"..
    "\n"..
    "Номери також можна запрограмувати за допомогою програматора Techage.\n"..
    "\n"..
    ".\n"..
    "\n",
    "TA3 Тригер змінює свій стан при кожній отриманій команді 'on'. Отримані команди 'off' ігноруються. Залежно від зміни стану\\, команди 'on' / 'off' надсилаються почергово. Необхідно ввести номер цільового блока або номери цільових блоків. Номери також можуть бути запрограмовані за допомогою Techage програматора.\n"..
    "\n"..
    "Наприклад\\, лампи можна вмикати і вимикати за допомогою кнопок.\n"..
    "\n"..
    "\n"..
    "\n",
    "TA3 Логічний блок може бути запрограмований таким чином\\, що одна або кілька вхідних команд будуть пов'язані з однією вихідною командою і надіслані. Таким чином\\, цей блок може замінити різні логічні елементи\\, такі як AND (І)\\, OR (АБО)\\, NOT (НЕ)\\, XOR (виключне АБО) тощо.\n"..
    "Вхідними командами для логічного блока є команди 'on' / 'off'.\n"..
    "Вхідні команди позначаються номером\\, наприклад\\, '1234' для команди від відправника з номером 1234.\n"..
    "Те саме стосується і команд виводу.\n"..
    "\n"..
    "Правило має таку структуру:\n"..
    "\n"..
    "    <output> = on/off if <input-expression> is true\n"..
    "\n"..
    "'<output>' - це номер блока\\, в який повинна бути надіслана команда.\n"..
    "'<input-expression>' - це булеве вираз\\, в якому оцінюються вхідні числа.\n"..
    "\n"..
    "*Приклади для вхідного виразу*\n"..
    "\n"..
    "Логічне НЕ:\n"..
    "\n"..
    "    1234 == off.\n"..
    "\n"..
    "Логічне І:\n"..
    "\n"..
    "    1234 == on. and 2345 == on.\n"..
    "\n"..
    "Логічне АБО:\n"..
    "\n"..
    "    1234 == on. or 2345 == on.\n"..
    "\n"..
    "Допустимі такі оператори:  'and'   'or'   'on'   'off'   'me'   '=='   '~='   '('   ')'\n"..
    "\n"..
    "Якщо вираз істинний\\, то в блок з номером '<output>' надсилається команда.\n"..
    "Можна задати до чотирьох правил\\, при цьому всі правила завжди перевіряються при отриманні команди.\n"..
    "Внутрішній час обробки всіх команд становить 100 мс.\n"..
    "\n"..
    "Ваш власний номер вузла може бути вказаний за допомогою ключового слова 'me'. Це дозволяє блоку надсилати самому собі команду (функція флип-флопа).\n"..
    "\n"..
    "Час блокування визначає паузу після команди\\, протягом якої логічний блок не приймає жодних подальших зовнішніх команд. Команди\\, отримані в період блокування\\, відкидаються. Час блокування може бути заданий у секундах.\n"..
    "\n"..
    "\n"..
    "\n",
    "Повторювач надсилає отриманий сигнал на всі налаштовані номери.\n"..
    "Це може мати сенс\\, наприклад\\, якщо ви хочете керувати декількома блоками одночасно. Повторювач можна налаштувати за допомогою програматора\\, що можливо не для всіх блоків.\n"..
    "\n"..
    "\n"..
    "\n",
    "Секвенсор може надсилати серію команд 'увімк' / 'вимк'\\, при цьому інтервал між командами повинен бути вказаний у секундах. За його допомогою можна\\, наприклад\\, змусити мигати лампу.\n"..
    "Можна налаштувати до 8 команд\\, кожна з яких міститиме номер цільового блока та очікування наступної команди.\n"..
    "Секвенсор повторює команди нескінченно\\, якщо встановлено параметр \"Run endless\".\n"..
    "Якщо нічого не вибрано\\, то очікуватиметься лише вказаний у секундах час.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Таймер може надсилати команди в різний час. Для кожного командного рядка можна вказати час\\, номер (номери) цілі та саму команду. Це означає\\, що лампи можна вмикати ввечері і вимикати вранці.\n"..
    "\n"..
    "\n"..
    "\n",
    "Термінал використовується здебільшого для тестування командного інтерфейсу інших блоків (див. \"Логічні/комутаційні блоки\")\\, а також для автоматизації систем з використанням мови програмування BASIC.\n"..
    "Ви також можете призначити команди клавішам і використовувати термінал продуктивно.\n"..
    "\n"..
    "    set <button-num> <button-text> <command>\n"..
    "\n"..
    "За допомогою команди 'set 1 ON cmd 123 on'\\, наприклад\\, користувацька клавіша 1 може бути запрограмована на команду 'cmd 123 on'. При натисканні клавіші команда буде надіслана\\, а відповідь виведена на екран.\n"..
    "\n"..
    "Термінал має такі локальні команди:\n"..
    "\n"..
    "  - 'clear' очистити екран\n"..
    "  - 'help' виводить сторінку допомоги\n"..
    "  - 'pub' перемкнутися на публічні кнопки\n"..
    "  - 'priv' перемкнутися на приватні кнопки\n"..
    "\n"..
    "У приватному режимі термінал можуть використовувати лише ті гравці\\, які можуть будувати в цьому місці\\, тобто мають права на захист.\n"..
    "\n"..
    "У публічному режимі всі гравці можуть використовувати попередньо налаштовані ключі.\n"..
    "\n"..
    "Перемкнутися в режим BASIC можна за допомогою відкритого гайкового меню. Детальнішу інформацію про режим BASIC ви можете знайти тут\n"..
    "\n"..
    "\n"..
    "\n",
    "Кольорова лампа може бути увімкнена або вимкнена за допомогою команди 'on' / 'off'. Ця лампа не потребує електрики і може бути пофарбована за допомогою інструмента аерографа з мода Unified Dyes та/або за допомогою команд Lua/Beduino.\n"..
    "\n"..
    "За допомогою команди чату '/ta_color' відображається кольорова палітра зі значеннями для команд Lua/Beduino\\, а за допомогою '/ta_send color <num>' колір можна змінити.\n"..
    "\n"..
    "\n"..
    "\n",
    "За допомогою цих блоків можна реалізувати двері та ворота\\, які можна відкривати за допомогою команд (блоки зникають) і знову закривати. Для кожних воріт або дверей потрібен один контролер.\n"..
    "\n"..
    "Зовнішній вигляд блоків можна налаштувати за допомогою меню блоків.\n"..
    "Це дозволяє реалізувати секретні двері\\, які відкриваються лише для певних гравців (за допомогою детектора гравців).\n"..
    "\n"..
    "\n"..
    "\n",
    "Дверний контролер використовується для керування блоками дверей/воріт TA3. За допомогою дверного контролера необхідно ввести номери блоків дверей/воріт. Якщо на контролер дверей подається команда 'on' / 'off'\\, це відкриває/закриває двері або ворота.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Контролер дверей II (далі КД2) може знімати і встановлювати всі типи блоків. Для налаштування КД2 необхідно натиснути кнопку \"Запис\". Потім необхідно натиснути на всі блоки\\, які повинні бути частиною дверей/воріт. Потім необхідно натиснути кнопку \"Готово\". Можна вибрати до 16 блоків. Видалені блоки зберігаються в інвентарі контролера. Функціонування контролера можна перевірити вручну за допомогою кнопки \"Обмін\". Якщо на контролер Door Controller II подається команда 'on' / 'off'\\, він також видаляє або встановлює блоки.\n"..
    "\n"..
    "За допомогою '$send_cmnd(node_number\\, \"exchange\"\\, 2)' окремі блоки можуть бути встановлені\\, видалені або замінені іншими блоками з інвентарю.\n"..
    "\n"..
    "За допомогою '$send_cmnd(node_number\\, \"set\"\\, 2)' блок з інвентарю може бути встановлений явно\\, якщо слот інвентарю не порожній.\n"..
    "\n"..
    "Блок може бути знову видалений за допомогою '$send_cmnd(node_number\\, \"dig\"\\, 2)'\\, якщо слот інвентарю порожній.\n"..
    "\n"..
    "Ім'я блока набору повертається за допомогою '$send_cmnd(node_number\\, \"get\"\\, 2)'.\n"..
    "\n"..
    "Номер слота інвентарю (1 ... 16) повинен бути переданий як корисне навантаження у всіх трьох випадках.\n"..
    "\n"..
    "За допомогою '$send_cmnd(node_number\\, \"reset\")' відбувається скидання контролера дверей.\n"..
    "\n"..
    "Це також можна використовувати для імітації висувних сходів тощо.\n"..
    "\n"..
    ".\n"..
    "\n",
    "За допомогою звукового блока можна відтворювати різні звуки. Доступні всі звуки модів Techage\\, Signs Bot\\, Hyperloop\\, Unified Inventory\\, TA4 Jetpack і Minetest Game.\n"..
    "\n"..
    "Звуки можна вибирати і відтворювати через меню і за допомогою команд.\n"..
    "\n"..
    "  - Команда 'on' для відтворення звуку\n"..
    "  - Команда 'sound <idx>' для вибору звуку за індексом\n"..
    "  - Команда 'gain <volume>' дозволяє регулювати гучність за допомогою значення '<volume>' (від 1 до 5).\n"..
    "\n"..
    "\n"..
    "\n",
    "Конвертер Mesecons використовується для перетворення команд вмикання/вимикання Techage в сигнали Mesecons і навпаки.\n"..
    "Для цього необхідно ввести один або кілька номерів вузлів і використовувати конвертер з блоками Mesecons.\n"..
    "повинні бути підключені через кабелі Mesecons. Конвертер Mesecons також може бути сконфігурований за допомогою програматора.\n"..
    "Конвертер Mesecons приймає до 5 команд на секунду\\; при вищому навантаженні він вимикається.\n"..
    "\n"..
    "*Цей вузол існує лише в тому випадку\\, якщо активний мод mesecons!*.\n"..
    "\n"..
    "\n"..
    "\n",
    "Детектори сканують навколишній простір і подають команду 'увімкнути'\\, коли пошук розпізнано.\n"..
    "\n"..
    "\n"..
    "\n",
    "Детектор - це спеціальний блок трубок\\, який виявляє\\, коли через трубку проходять предмети. Для цього він повинен бути підключений до трубок з обох сторін. Якщо предмети проштовхуються в детектор за допомогою штовхача\\, вони автоматично передаються далі.\n"..
    "Він надсилає сигнал \"увімкнено\"\\, коли предмет розпізнано\\, і сигнал \"вимкнено\" секундою пізніше.\n"..
    "Потім подальші команди блокуються на 8 секунд.\n"..
    "Час очікування та елементи\\, які повинні викликати команду\\, можна налаштувати за допомогою відкритого гайкового меню.\n"..
    "\n"..
    "\n"..
    "\n",
    "Детектор візків надсилає команду 'on'\\, якщо він розпізнав візок (Minecart) прямо перед собою. Крім того\\, детектор може перезапустити візок при отриманні команди 'on'.\n"..
    "\n"..
    "Детектор також можна запрограмувати на свій власний номер. У цьому випадку він штовхає всі вагони\\, які зупиняються поруч з ним (один квартал у всіх напрямках).\n"..
    "\n"..
    "\n"..
    "\n",
    "Детектор блоків надсилає команду 'on'\\, якщо виявляє\\, що перед ним з'являються або зникають блоки\\, але повинен бути налаштований відповідним чином. Після повернення детектора у стандартний стан (сірий блок) надсилається команда 'off'. Допустимими блоками є всі типи блоків і рослин\\, але не тварини або гравці. Радіус дії датчика становить 3 блоки/метри в напрямку стрілки.\n"..
    "\n"..
    "\n"..
    "\n",
    "Детектор гравців надсилає команду 'on'\\, якщо виявляє гравця в межах 4 м від блока. Якщо гравець знову залишає зону\\, надсилається команда 'off'.\n"..
    "Якщо пошук повинен бути обмежений конкретними гравцями\\, можна також ввести імена цих гравців.\n"..
    "\n"..
    "\n"..
    "\n",
    "Детектор світла надсилає команду 'on'\\, якщо рівень освітленості блока перевищує певний рівень\\, який можна задати через меню правої кнопки миші.\n"..
    "Якщо у вас є TA4 Lua контролер\\, ви можете отримати точне значення рівня освітленості за допомогою $get_cmd(num\\, 'light_level').\n"..
    "\n"..
    ".\n"..
    "\n",
    "У TA3 є ті самі машини\\, що і в TA2\\, тільки вони потужніші і потребують електрики замість механічного приводу.\n"..
    "Тому нижче наведені лише різні технічні характеристики.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Функціональність така сама\\, як TA2.\n"..
    "Продуктивність становить 6 елементів кожні 2 с.\n"..
    "\n"..
    "\n"..
    "\n",
    "Функціональність така сама\\, як TA2.\n"..
    "Продуктивність становить 12 елементів кожні 4 с.\n"..
    "\n"..
    "\n"..
    "\n",
    "Функціональність така сама\\, як TA2.\n"..
    "Продуктивність становить 2 предмети кожні 4 с. Автокрафтер потребує 6 ku електроенергії.\n"..
    "\n"..
    "\n"..
    "\n",
    "Функціональність така сама\\, як TA2\\, тільки тут виробляються мікросхеми TA4 WLAN.\n"..
    "Продуктивність становить один чип кожні 6 с. Для цього блоку потрібно 12 ku електроенергії.\n"..
    "\n"..
    "\n"..
    "\n",
    "Функціональність така сама\\, як TA2.\n"..
    "Максимальна глибина - 40 метрів. Для роботи кар'єру потрібно 12 ku електроенергії.\n"..
    "\n"..
    "\n"..
    "\n",
    "Функціональність така сама\\, як TA2.\n"..
    "Продуктивність становить 2 елементи кожні 4 с. Блок потребує 4 ku електроенергії.\n"..
    "\n"..
    "\n"..
    "\n",
    "Функціональність така сама\\, як TA2.\n"..
    "Ймовірність також така сама\\, як і для TA2. Блок також потребує 3 ku електроенергії.\n"..
    "Але на відміну від TA2\\, статус блока TA3 можна зчитати (контролер)\n"..
    "\n"..
    "\n"..
    "\n",
    "Функціональність така сама\\, як TA2.\n"..
    "Продуктивність становить 2 елементи кожні 4 с. Блок потребує 6 ku електроенергії.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Інжектор являє собою штовхач TA3 з особливими властивостями. Він має меню для налаштування. Тут можна налаштувати до 8 предметів. Він бере ці предмети лише зі скрині\\, щоб передати їх машинам з рецептами (автокрафтер\\, промислова піч і електронна фабрика).\n"..
    "\n"..
    "При передачі у цільовій машині використовується лише одна позиція в інвентарі. Якщо\\, наприклад\\, в інжекторі налаштовані лише перші три позиції\\, то в інвентарі машини використовуються лише перші три місця зберігання. Таким чином\\, запобігається переповнення інвентарю машини.\n"..
    "\n"..
    "Інжектор також можна перемкнути в \"режим витягування\". Тоді він дістає предмети зі скрині лише з тих позицій\\, які задані в конфігурації інжектора. При цьому тип і позиція предмета повинні збігатися. Це дозволяє спорожняти певні позиції інвентарю в скрині.\n"..
    "\n"..
    "Продуктивність становить до 8 разів по одному елементу кожні 4 секунди.\n"..
    "\n"..
    ".\n"..
    "\n",
    "",
    "Techage Гайковий ключ має декілька функцій. Він показує час\\, позицію\\, температуру і біом при натисканні на невідомий блок.\n"..
    "Якщо натиснути на блок TechAge з командним інтерфейсом\\, будуть показані всі доступні дані (див. також \"Логічні / комутаційні блоки\").\n"..
    "\n"..
    "За допомогою Shift + правий клік можна відкрити розширене меню для деяких блоків. Залежно від блока тут можна викликати додаткові дані або виконати спеціальні налаштування. Наприклад\\, у випадку генератора можна запрограмувати криву заряджання/вимкнення.\n"..
    "\n"..
    "\n"..
    "\n",
    "За допомогою програматора номери блоків можна збирати з декількох блоків правим клацанням миші і записувати в блок\\, як кнопку/перемикач\\, лівим клацанням.\n"..
    "Якщо натиснути в повітрі\\, внутрішня пам'ять буде видалена.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Кельма використовується для оштукатурювання силових кабелів. Див. також \"TA Електричний кабель\".\n"..
    "\n"..
    "\n"..
    "\n",
    "Цей інструмент можна використовувати для видалення блоків бурильних труб\\, якщо\\, наприклад\\, у них буде проходити тунель.\n"..
    "\n"..
    "\n"..
    "\n",
    "Викрутка Techage слугує заміною звичайній викрутці. Вона має такі функції:\n"..
    "\n"..
    "  - Лівий клік: повернути блок ліворуч\n"..
    "  - Клацання правою кнопкою миші: повернути видиму сторону блока вгору\n"..
    "  - Shift + лівий клік: зберегти вирівнювання клацнутого блока.\n"..
    "  - Shift + правий клік: застосувати збережене вирівнювання до клацнутого блока.\n"..
    "\n"..
    ".\n"..
    "\n",
    "TechAge Інструмент для збирання використовується для видалення і перестановки блоків Techage без втрати номера блока або присвоєння йому нового номера при встановленні. Це корисно\\, наприклад\\, для кар'єрів\\, оскільки їх часто доводиться переміщувати.\n"..
    "\n"..
    "  - Ліва кнопка: Видалити блок\n"..
    "  - Права кнопка: Встановити блок\n"..
    "\n"..
    "Блок\\, який раніше був видалений за допомогою інструмента для збирання і повинен бути поміщений знову\\, повинен знаходитися в крайній лівій частині інвентарю гравця.\n"..
    "\n"..
    "\n"..
    "\n",
  },
  images = {
    "techage_ta3",
    "",
    "ta3_firebox",
    "ta3_oilbox",
    "ta3_boiler",
    "ta3_turbine",
    "ta3_generator",
    "ta3_cooler",
    "ta3_powerswitch",
    "power_reduction",
    "ta3_powercable",
    "ta3_powerjunction",
    "ta3_powerline",
    "ta3_powerpole",
    "ta3_powerpole4",
    "ta3_powerpole2",
    "ta3_powerswitch",
    "ta3_powerswitchsmall",
    "ta3_powerswitchbox",
    "ta3_tinygenerator",
    "ta3_akkublock",
    "ta3_powerterminal",
    "ta3_motor",
    "",
    "ta3_furnacefirebox",
    "ta3_furnace",
    "ta3_booster",
    "",
    "ta3_tank",
    "ta3_pump",
    "ta3_filler",
    "ta3_pipe",
    "ta3_pipe_wall_entry",
    "ta3_valve",
    "techage_ta3",
    "ta3_oilexplorer",
    "ta3_drillbox",
    "ta3_pumpjack",
    "ta3_drillbit",
    "oiltank",
    "",
    "",
    "",
    "",
    "",
    "techage_ta31",
    "",
    "reboiler",
    "ta3_logic",
    "ta3_button",
    "ta3_command_converter",
    "ta3_flipflop",
    "ta3_logic",
    "ta3_repeater",
    "ta3_sequencer",
    "ta3_timer",
    "ta3_terminal",
    "ta3_colorlamp",
    "ta3_doorblock",
    "ta3_doorcontroller",
    "ta3_doorcontroller",
    "ta3_soundblock",
    "ta3_mesecons_converter",
    "ta3_nodedetector",
    "ta3_detector",
    "ta3_cartdetector",
    "ta3_nodedetector",
    "ta3_playerdetector",
    "ta3_lightdetector",
    "ta3_grinder",
    "ta3_pusher",
    "ta3_distributor",
    "ta3_autocrafter",
    "ta3_electronicfab",
    "ta3_quarry",
    "ta3_gravelsieve",
    "ta3_gravelrinser",
    "ta3_grinder",
    "ta3_injector",
    "",
    "ta3_end_wrench",
    "ta3_programmer",
    "ta3_trowel",
    "ta3_drill_pipe_wrench",
    "ta3_screwdriver",
    "techage:assembly_tool",
  },
  plans = {
    "",
    "coalpowerstation",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "ta3_furnace",
    "",
    "",
    "",
    "ta3_tank",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "ta3_loading",
    "",
    "",
    "",
    "ta3_distiller",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
  }
}
