return {
  titles = {
    "1,TA4: Сьогодення",
    "2,Вітрогенератор",
    "3,TA4 Вітрогенератор",
    "3,TA4 Гондола вітрогенератора",
    "3,TA4 Сигнальна лампа вітрогенератора",
    "3,TA4 Щогла",
    "2,Сонячна електростанція",
    "3,TA4 Сонячний модуль",
    "3,TA4 Кронштейн для сонячних батарей",
    "3,TA4 Сонячний інвертор",
    "3,TA4 Низьковольтний кабель",
    "3,TA4 Низьковольтний сполучувач",
    "3,TA4 Сонячний елемент для вуличного ліхтаря",
    "2,Тепловий накопичувач енергії",
    "3,TA4 Теплообмінник",
    "3,TA4 Турбіна",
    "3,TA4 Генератор",
    "3,TA4 Ввід труби",
    "3,TA3 Труба",
    "2,Розподіл живлення",
    "3,TA4 Ізолювальний трансформатор",
    "3,TA4 Електричний лічильник",
    "3,TA4 Лазер",
    "2,Водень",
    "3,Електролізер",
    "3,Паливний елемент",
    "2,Хімічний реактор",
    "3,TA4 Дозатор",
    "3,TA4 Хімічний реактор",
    "3,TA4 Заливна труба",
    "3,TA4 Підставка для реактора",
    "3,TA4 База реактора",
    "3,TA4 Бункер",
    "2,ICTA Контролер",
    "3,TA4 ICTA контролер",
    "3,Батарея",
    "3,TA4 Дисплей",
    "3,TA4 Дисплей XL",
    "3,TA4 Сигнальна вежа",
    "2,TA4 Lua контролер",
    "3,TA4 Lua сервер",
    "3,TA4 Блок датчиків / скриня",
    "3,TA4 Термінал Lua контролера",
    "2,TA4 Логічні/комутаційні модулі",
    "3,TA4 Кнопка/перемикач",
    "3,TA4 2x Кнопка",
    "3,TA4 4x Кнопка",
    "3,TA4 2x Сигнальна лампа",
    "3,TA4 4x Сигнальна лампа",
    "3,TA4 Детектор гравців",
    "3,TA4 Збирач станів",
    "3,TA4 Детектор предметів",
    "3,TA4 Детектор блоків",
    "3,TA4 Детектор заряду накопичувачів енергії",
    "3,TA4 Датчик погляду",
    "3,TA4 Секвенсор",
    "2,Контролери переміщення/повороту",
    "3,TA4 Контролер переміщення",
    "3,TA4 Контролер повороту",
    "2,TA4 Лампи",
    "3,TA4 Фітолампа",
    "3,TA4 Вуличний ліхтар",
    "3,TA4 Світлодіодна промислова лампа",
    "3,TA4 Світлофор",
    "2,TA4 Рідинний фільтр",
    "3,Базовий шар",
    "3,Шар гравію",
    "3,Шар наповнення",
    "2,TA4 Колайдер (прискорювач частинок)",
    "3,Детектор колайдера",
    "3,TA4 Термінал керування",
    "3,Охолодження та живлення",
    "3,Будівництво",
    "2,Більше блоків TA4",
    "3,TA4 Блок рецептів",
    "3,TA4 Автокрафтер",
    "3,TA4 Резервуар",
    "3,TA4 Насос",
    "3,TA4 Нагрівач печі",
    "3,TA4 Водяний насос (застарілий)",
    "3,TA4 Водозабір",
    "3,TA4 Труба",
    "3,TA4 Штовхач",
    "3,TA4 Скриня",
    "3,TA4 8x2000 Скриня",
    "3,TA4 Розподільник",
    "3,TA4 Високопродуктивний розподільник",
    "3,TA4 Просіювач",
    "3,TA4 Подрібнювач",
    "3,TA4 Кар'єр",
    "3,TA4 Водовидалювач",
    "3,TA4 Електронна фабрика",
    "3,TA4 Інжектор",
    "3,TA4 Переробник",
  },
  texts = {
    "Відновлювані джерела енергії\\, такі як вітер\\, сонце і біопаливо\\, допоможуть вам покинути нафтову добу. За допомогою сучасних технологій та розумних машин ви вирушаєте в майбутнє.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Вітрогенератор завжди дає електрику\\, коли є вітер. У грі вітру немає\\, але мод симулює це\\, вмикаючи вітряки лише вранці (5:00 - 9:00) і ввечері (17:00 - 21:00). Вітрогенератор дає електрику лише в тому випадку\\, якщо він встановлений у придатному місці.\n"..
    "\n"..
    "Вітряні електростанції TA - це виключно шельфові установки\\, тобто вони повинні бути побудовані в морі. Це означає\\, що вітрові турбіни можуть бути побудовані лише в морському (океанічному) біомі і що навколо щогли повинно бути достатньо води і хороший огляд.\n"..
    "\n"..
    "Щоб знайти придатне місце\\, натисніть на воду за допомогою гайкового ключа (TechAge Info Tool). У чаті з'явиться повідомлення про те\\, чи підходить це місце для щогли вітряка.\n"..
    "\n"..
    "Струм повинен бути проведений від блока ротора вниз через щоглу. Спочатку протягніть силовий кабель вгору\\, а потім \"заштукатурте\" його за допомогою опорних блоків TA4. Внизу можна побудувати робочу платформу. На плані праворуч показана конструкція у верхній частині.\n"..
    "\n"..
    "Вітрогенератор видає 70 ku\\, але лише 8 годин на день (див. вище).\n"..
    "\n"..
    "\n"..
    "\n",
    "Блок вітрогенератора (ротор) - це серце вітрогенератора. Цей блок повинен бути розміщений на вершині щогли. В ідеалі при висоті над рівнем моря Y = 15\\, тоді ви залишитеся в межах блока карти / блока завантаження карти(forceload)\\, розміщеного на рівні моря.\n"..
    "При запуску турбіни перевіряються всі умови для роботи вітряка. Якщо всі умови дотримані\\, лопаті ротора (крила) з'являються автоматично. В іншому випадку ви отримаєте повідомлення про помилку.\n"..
    "\n"..
    "\n"..
    "\n",
    "Цей блок повинен бути розташований на чорному кінці блока вітрогенератора.\n"..
    "\n"..
    "\n"..
    "\n",
    "Ця лампочка, що блимає, призначена лише для декоративних цілей і може бути розміщена на верхній частині блока вітрогенератора.\n"..
    "\n"..
    "\n"..
    "\n",
    "Таким чином будується щогла для вітрогенератора. Однак ці блоки не встановлюються вручну\\, а повинні бути встановлені за допомогою шпателя\\, так що лінія електропередачі до верхівки щогли замінюється цими блоками (див. розділ \"TA Електричний кабель\").\n"..
    "\n"..
    "\n"..
    "\n",
    "Сонячна електростанція виробляє електрику лише тоді\\, коли світить сонце. У грі це відбувається кожного ігрового дня з 6:00 ранку до 6:00 вечора.\n"..
    "У цей час завжди доступна однакова потужність. Після 18:00 сонячні модулі повністю вимикаються.\n"..
    "\n"..
    "Температура в біомі має вирішальне значення для роботи сонячних модулів. Чим спекотніша температура\\, тим ефективніша генерація електроенергії.\n"..
    "Температуру біома можна визначити за допомогою Techage Info Tool (гайковий ключ). Зазвичай вона коливається між 0 і 100:\n"..
    "\n"..
    "  - повна потужність доступна при температурі 100 градусів\n"..
    "  - при 50 градусах доступна половина потужності\n"..
    "  - при 0 градусах сонячна електроенергія недоступна\n"..
    "\n"..
    "Тому для сонячної електростанції рекомендується шукати спекотні степи і пустелі.\n"..
    "Для передачі електроенергії є повітряні лінії.\n"..
    "Однак можна виробляти й водень\\, який можна транспортувати і перетворювати в електрику в місці призначення.\n"..
    "\n"..
    "Найменша одиниця в сонячній системі - це два сонячних модулі та один модуль-носій. Несучий модуль повинен бути розміщений першим\\, а два сонячних модулі зліва і справа від нього (не вище!).\n"..
    "\n"..
    "На плані праворуч показані 3 блоки\\, кожен з двома сонячними модулями і одним несучим модулем\\, підключені до інвертора за допомогою червоних кабелів.\n"..
    "\n"..
    "Сонячні модулі видають постійну напругу\\, яка не може бути подана безпосередньо в електромережу. Тому спочатку сонячні модулі необхідно підключити до інвертора через червоний кабель. Модуль має два з'єднання\\, одне з яких призначене для підключення червоного кабелю до сонячних модулів (постійний струм)\\, а інше - для підключення сірого кабелю до електромережі (змінний струм).\n"..
    "\n"..
    "Область карти\\, на якій розташована сонячна електростанція\\, повинна бути повністю завантажена. Це стосується і позиції над сонячним модулем\\, оскільки там регулярно вимірюється сила світла. Тому рекомендується спочатку встановити блок завантаження карти (forceload)\\, а потім розмістити модулі в цій області.\n"..
    "\n"..
    "\n"..
    "\n",
    "Сонячний модуль повинен бути встановлений на несучий модуль. Завжди потрібно два сонячних модулі.\n"..
    "У парі сонячні модулі виробляють до 3 ku електроенергії\\, залежно від температури на місці встановлення.\n"..
    "При використанні сонячних модулів необхідно стежити за тим\\, щоб вони були повністю освітлені денним світлом і не були затінені блоками або деревами. Це можна перевірити за допомогою ТА гайкового ключа (Info Tool).\n"..
    "\n"..
    "\n"..
    "\n",
    "Кронштейн доступний у двох варіантах висоти (1 м і 2 м). Обидва варіанти функціонально ідентичні.\n"..
    "Кронштейни можна розміщувати безпосередньо поруч один з одним і таким чином з'єднувати їх у ряд. Підключення до інвертора або до інших серій модулів повинно здійснюватися за допомогою червоних низьковольтних кабелів або низьковольтних сполучувачів.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Інвертор перетворює сонячну енергію постійного струму в змінний струм\\, щоб вона могла бути подана в електромережу.\n"..
    "Інвертор може подавати максимум 100 ku електроенергії\\, що відповідає 33 сонячним модулям або більше.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Низьковольтний кабель використовується для підключення рядів сонячних модулів до інвертора. Кабель не повинен використовуватися для інших цілей.\n"..
    "\n"..
    "Максимальна довжина кабелю становить 200 м.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Розподільна коробка повинна бути встановлена на підлозі. Вона має лише 4 з'єднання (у 4 напрямках).\n"..
    "\n"..
    "\n"..
    "\n",
    "Як випливає з назви\\, сонячна батарея для вуличного ліхтаря використовується для живлення вуличного ліхтаря. Один сонячний елемент може живити дві лампи (1 кю). Сонячна батарея накопичує сонячну енергію протягом дня і подає електрику на лампу вночі. Це означає\\, що лампа світиться лише в темряві.\n"..
    "\n"..
    "Цей сонячний елемент не можна комбінувати з іншими сонячними модулями.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Тепловий накопичувач енергії замінює акумуляторний блок з TA3.\n"..
    "\n"..
    "Тепловий накопичувач енергії складається з бетонної оболонки (бетонних блоків)\\, заповненої гравієм. Можливі п'ять розмірів накопичувача:\n"..
    "\n"..
    "  - Кришка з бетонних блоків 5x5x5\\, заповнена гравієм 27\\, місткість: 22\\,5 kud\n"..
    "  - Кришка з бетонних блоків 7x7x7\\, заповнена гравієм 125\\, місткість: 104 kud\n"..
    "  - Кришка з бетонних блоків 9x9x9\\, заповнена гравієм 343\\, місткість: 286 kud\n"..
    "  - Кришка з бетонних блоків 11x11x11\\, заповнена гравієм 729\\, місткість: 610 kud\n"..
    "  - Кришка з бетонних блоків 13x13x13\\, заповнена гравієм 1331\\, місткість: 1112 kud\n"..
    "\n"..
    "У бетонній оболонці може бути вікно з обсидіанового скляного блока. Воно повинно розташовуватися точно посередині стіни. Через це вікно можна побачити\\, чи завантажений накопичувач більш ніж на 80 %. На плані праворуч показана структура TA4 теплообмінника\\, що складається з 3 блоків\\, TA4 турбіни та TA4 генератора. Зверніть увагу на вирівнювання теплообмінника (стрілка на блоці 1 повинна вказувати на турбіну).\n"..
    "\n"..
    "На відміну від плану праворуч\\, з'єднання на блоці зберігання повинні знаходитися на одному рівні (розташовуватися горизонтально\\, тобто не знизу і не зверху). TA4 Вводи труб повинні знаходитися точно посередині стіни і бути обернені один до одного. Жовті TA3 труби використовуються як парові труби. Парові труби TA2 тут використовувати не можна.\n"..
    "Як генератор\\, так і теплообмінник мають силовий роз'єм і повинні бути підключені до електромережі.\n"..
    "\n"..
    "У принципі\\, тепловий накопичувач енергії працює точно так само\\, як і TA3 акумулятори\\, тільки з набагато більшою ємністю.\n"..
    "\n"..
    "Для того щоб система зберігання тепла працювала\\, всі блоки (також бетонна оболонка і гравій) повинні бути завантажені за допомогою блока завантаження карти (forceload).\n"..
    "\n"..
    "\n"..
    "\n",
    "Теплообмінник складається з 3 частин\\, які потрібно поставити одна на одну\\, причому стрілка першого блока повинна бути спрямована в бік турбіни. З'єднання турбіни і теплообмінника повинно здійснюватися TA3 жовтими трубами.\n"..
    "Теплообмінник повинен бути підключений до електромережі. Накопичувач енергії заряджається через теплообмінник за умови наявності достатньої кількості електроенергії.\n"..
    "\n"..
    "\n"..
    "\n",
    "Турбіна є частиною накопичувача енергії. Вона повинна бути розміщена поруч з генератором і з'єднана з теплообмінником за допомогою жовтих труб TA4\\, як показано на плані.\n"..
    "\n"..
    "\n"..
    "\n",
    "Генератор є частиною накопичувача енергії. Він використовується для вироблення електроенергії і таким чином вивільняє енергію з енергонакопичувача. Тому генератор також повинен бути підключений до електромережі.\n"..
    "\n"..
    "Увага: і теплообмінник\\, і генератор повинні бути підключені до однієї електромережі!\n"..
    "\n"..
    "\n"..
    "\n",
    "По одному блоку вводу труби повинно бути встановлено з обох сторін блока зберігання. Блоки повинні розташовуватися точно навпроти один одного.\n"..
    "\n"..
    "Блоки вводу труб *не можуть* використовуватися як приховані труби в стіні\\, замість них використовуйте TA3 блоки вводу труб у стіну.\n"..
    "\n"..
    "\n"..
    "\n",
    "TA3 Жовті труби використовуються для передачі газу і рідин.\n"..
    "Максимальна довжина трубопроводу становить 100м (блоків).\n"..
    "\n"..
    "\n"..
    "\n",
    "За допомогою силових кабелів і розподільних коробок можна створювати електричні мережі до 1000 блоків/вузлів. Однак слід зазначити\\, що необхідно враховувати і розподільні коробки. Це означає\\, що до електромережі можна підключити до 500 генераторів/накопичувачів/машин/ламп тощо.\n"..
    "\n"..
    "За допомогою розділового трансформатора і лічильника електроенергії можна з'єднувати мережі\\, утворюючи ще більші структури.\n"..
    "\n"..
    "\n"..
    "\n",
    "За допомогою розділового трансформатора можна з'єднати дві електромережі в одну велику мережу. Розділовий трансформатор може передавати електроенергію в обох напрямках.\n"..
    "\n"..
    "Розділовий трансформатор може передавати до 300 ku. Максимальне значення регулюється через меню гайкового ключа.\n"..
    "\n"..
    "\n"..
    "\n",
    "За допомогою електролічильника можна з'єднати дві електричні мережі в одну велику мережу. Електролічильник передає електроенергію лише в одному напрямку (зверніть увагу на стрілку). Кількість пропущеної через нього електроенергії (в kud) вимірюється і відображається на дисплеї. Це значення також може бути запитане Lua контролером за допомогою команди 'consumption'. Поточний струм можна дізнатися за допомогою команди 'current'.\n"..
    "\n"..
    "Лічильник електроенергії може пропускати до 200 ku. Максимальне значення налаштовується через меню гайкового ключа.\n"..
    "\n"..
    "Через меню гайкового ключа можна також ввести зворотний відлік потужності. Коли цей відлік досягне нуля\\, лічильник електроенергії вимкнеться. Зворотний відлік можна запитати за допомогою команди 'countdown'.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Лазер TA4 використовується для бездротової передачі енергії. Для цього необхідні два блоки: TA4 лазерний випромінювач та TA4 приймач лазерного променя. Між двома блоками повинен бути повітряний зазор\\, щоб лазерний промінь міг поширюватися від випромінювача до приймача. Спочатку необхідно встановити випромінювач. Це відразу ж вмикає лазерний промінь і показує можливі положення приймача. Можливі позиції приймача також відображаються в чаті.\n"..
    "\n"..
    "За допомогою лазера можна долати відстані до 96 блоків. Як тільки з'єднання встановлено (струм не протікає)\\, про це повідомляється в інформаційному тексті випромінювача і приймача.\n"..
    "\n"..
    "Самі лазерні блоки не потребують електрики.\n"..
    "\n"..
    "\n"..
    "\n",
    "Електроліз можна використовувати для розділення електрики на водень і кисень. З іншого боку\\, водень можна перетворити назад на електрику за допомогою кисню з повітря\\, використовуючи паливний елемент.\n"..
    "Це дозволяє перетворювати надлишок електроенергії на водень і зберігати його.\n"..
    "У грі водень можна перетворити назад на електроенергію за допомогою паливного елемента.\n"..
    "\n"..
    "Це означає\\, що електроенергію (у вигляді водню) можна не лише зберігати в резервуарах\\, а й транспортувати за допомогою вагонетки-цистерни або труб.\n"..
    "\n"..
    "Однак перетворення електрики на водень і назад відбувається з втратами. Із 100 одиниць електроенергії після перетворення на водень і назад вийде лише 95 одиниць.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Електролізер перетворює електрику на водень.\n"..
    "Живлення повинно підключатися зліва. Водень можна відкачувати за допомогою труб і насосів з правого боку електролізера.\n"..
    "\n"..
    "Електролізер може споживати до 35 ku електроенергії\\, а потім генерувати водень кожні 4 секунди.\n"..
    "В електролізер поміщається 200 одиниць водню.\n"..
    "\n"..
    "Електролізер має меню гайкового ключа для налаштування споживаного струму і точки відключення.\n"..
    "\n"..
    "Якщо накопичена в електромережі енергія падає нижче заданого значення точки відключення\\, електролізер автоматично відключається. Це запобігає спорожненню систем зберігання.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Паливний елемент перетворює водень на електрику.\n"..
    "Водень до нього повинен подаватися зліва за допомогою насоса. Підключення живлення знаходиться справа.\n"..
    "\n"..
    "Паливний елемент може виробляти до 34 ku електроенергії і потребує порції водню кожні 4 секунди.\n"..
    "\n"..
    "Зазвичай паливний елемент працює як генератор категорії 2 (як і інші акумуляторні системи).\n"..
    "У цьому випадку не можна заряджати інші блоки категорії 2\\, наприклад блок акумуляторів. Однак паливний елемент можна також використовувати як генератор категорії 1 за допомогою перемикача.\n"..
    "\n"..
    "\n"..
    "\n",
    "Реактор використовується для переробки нафтопродуктів\\, отриманих з дистиляційної колони або за іншими рецептами\\, у нові речовини.\n"..
    "На плані зліва показано лише один з можливих варіантів\\, оскільки розташування бункерів і резервуарів залежить від рецепта.\n"..
    "\n"..
    "Первинний продукт завжди виводиться на бічну сторону реакторної стійки\\, незалежно від того\\, є він порошком чи рідиною. Відходи (вторинний продукт) завжди вивантажуються в нижній частині реакторної стійки.\n"..
    "\n"..
    "Реактор складається з:\n"..
    "\n"..
    "  - Різні резервуари і бункери з інгредієнтами\\, які підключаються до дозатора за допомогою труб\n"..
    "  - Опційно - основа реактора\\, яка вивантажує відходи з реактора (потрібна лише для рецептів з двома вихідними продуктами)\n"..
    "  - Підставка для реактора\\, яка повинна бути встановлена на основу (якщо є). Підставка має підключення до електромережі і споживає 8 кю під час роботи.\n"..
    "  - Корпус реактора\\, який повинен бути встановлений на основу реактора\n"..
    "  - Заливна труба\\, яка повинна бути встановлена на корпусі реактора\n"..
    "  - Дозувальний пристрій\\, який повинен бути підключений до резервуарів або бункерів і заливної труби за допомогою труб\n"..
    "\n"..
    "Примітка 1: Рідкі речовини зберігаються лише в резервуарах\\, тверді речовини і речовини у вигляді порошку - лише в бункерах. Це стосується інгредієнтів і вихідних продуктів.\n"..
    "\n"..
    "Примітка 2: Резервуари або бункери з різним вмістом не повинні бути з'єднані в систему трубопроводів. Навпаки\\, кілька резервуарів або бункерів з однаковим вмістом можуть бути підвішені паралельно на одній лінії.\n"..
    "\n"..
    "При крекінгу довгі ланцюжки вуглеводнів розщеплюються на короткі за допомогою каталізатора.\n"..
    "Гіббситовий порошок слугує каталізатором (не витрачається). Його можна використовувати для перетворення бітуму на мазут\\, мазуту на нафту (лігроїн) і нафти на бензин.\n"..
    "\n"..
    "При гідрогенізації до молекули додають пари атомів водню\\, щоб перетворити короткоцепові вуглеводні на довголанцюгові.\n"..
    "Тут залізний порошок необхідний як каталізатор (не витрачається). Його можна використовувати для перетворення газу (пропану) на ізобутан\\,\n"..
    "ізобутану на бензин\\, бензину на нафту (лігроїн)\\, нафти на мазут\\, а мазуту на бітум.\n"..
    "\n"..
    "\n"..
    "\n",
    "Частина хімічного реактора.\n"..
    "Труби для подачі вихідних матеріалів можуть бути підключені з усіх 4 сторін дозатора. Інгредієнти для реактора надходять вгору.\n"..
    "\n"..
    "Рецепт можна задати і запустити реактор через дозатор.\n"..
    "\n"..
    "Як і у випадку з іншими машинами:\n"..
    "\n"..
    "  - якщо дозатор перебуває в режимі очікування\\, одного або кількох інгредієнтів бракує\n"..
    "  - якщо дозатор перебуває в заблокованому стані\\, вихідний бак або бункер переповнений\\, несправний або неправильно підключений\n"..
    "\n"..
    "Дозатор не потребує електрики. Рецепт обробляється кожні 10 с.\n"..
    "\n"..
    "\n"..
    "\n",
    "Хімічний реактор. У реакторі є інвентар для зберігання каталізаторів (для рецептів крекінгу і гідрогенізації).\n"..
    "\n"..
    "\n"..
    "\n",
    "Частина хімічного реактора. Повинна бути поміщена на реактор. Якщо це не спрацює\\, видаліть трубу у вищевказаному місці і помістіть її знову.\n"..
    "\n"..
    "\n"..
    "\n",
    "Частина хімічного реактора. Тут же знаходиться підключення живлення для реактора. Реактору потрібно 8 ku електроенергії.\n"..
    "\n"..
    "Стійка має два патрубки: справа - для вихідного продукту\\, знизу - для відходів\\, наприклад\\, червоного шламу при виробництві алюмінію.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Частина хімічного реактора. Необхідний для зливу відпрацьованого продукту.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Частина хімічного реактора. Необхідний для зберігання речовин у вигляді порошку або гранул.\n"..
    "\n"..
    "\n"..
    "\n",
    "Контролер ICTA\n"..
    "ICTA розшифровується як Якщо Умова То Дія (\"If Condition Then Action\") використовується для контролю і керування машинами. За допомогою контролера можна зчитувати дані з машин та інших блоків і залежно від цього вмикати/вимикати інші машини і блоки.\n"..
    "\n"..
    "Дані машини зчитуються\\, блоки і машини керуються за допомогою команд. Розділ TA3 -> Логічні/комутаційні блоки важливий для розуміння роботи команд.\n"..
    "\n"..
    "Для роботи контролера потрібна батарея. Дисплей використовується для виведення даних\\, сигнальна вежа - для відображення помилок.\n"..
    "\n"..
    "\n"..
    "\n",
    "Контролер працює на основі правил 'IF <умова> THEN <дія>'. Для одного контролера можна створити до 8 правил.\n"..
    "\n"..
    "Прикладами правил є:\n"..
    "\n"..
    "  - Якщо розподільник \"заблокований\"\\, штовхач перед ним повинен бути вимкнений\n"..
    "  - Якщо машина видає помилку\\, це повинно відображатися на дисплеї\n"..
    "\n"..
    "Контролер перевіряє ці правила циклічно. Для цього необхідно вказати час циклу в секундах (``Цикл/сек'') для кожного правила (1..1000).\n"..
    "\n"..
    "Для правил\\, що оцінюють вхідний сигнал вмикання/вимикання\\, наприклад\\, від перемикача або детектора\\, необхідно вказати час циклу 0. Значення 0 означає\\, що це правило повинно виконуватися завжди\\, коли вхідний сигнал змінився\\, наприклад\\, кнопка передала нове значення.\n"..
    "\n"..
    "Усі правила повинні виконуватися лише так часто\\, як це необхідно. Це має дві переваги:\n"..
    "\n"..
    "  - батарея контролера служить довше (для кожного контролера потрібна своя батарея)\n"..
    "  - навантаження на сервер нижче (отже\\, менше затримок)\n"..
    "\n"..
    "Для кожної дії необхідно задати час затримки ('після/с'). Якщо дія повинна бути виконана негайно\\, необхідно ввести 0.\n"..
    "\n"..
    "Контролер має власну довідку та інформацію по всіх командах через меню контролера.\n"..
    "\n"..
    "\n"..
    "\n",
    "Батарея повинна розташовуватися в безпосередній близькості від контролера\\, тобто в одному з 26 положень навколо контролера.\n"..
    "\n"..
    "\n"..
    "\n",
    "Після встановлення дисплей показує свій номер. За цим номером до дисплея можна звертатися. На дисплей можна виводити тексти\\, при цьому дисплей може відображати 5 рядків і\\, відповідно\\, 5 різних текстів.\n"..
    "\n"..
    "Рядки тексту завжди вирівнюються по лівому краю. Якщо текст повинен бути вирівняний по горизонталі\\, перед ним повинен стояти символ \"t\" (табулятор).\n"..
    "\n"..
    "Дисплей оновлюється не частіше одного разу на секунду.\n"..
    "\n"..
    "\n"..
    "\n",
    "Дисплей TA4 Дисплей XL удвічі більший за TA4 дисплей.\n"..
    "\n"..
    "Рядки тексту завжди вирівнюються по лівому краю. Якщо текст повинен бути вирівняний по горизонталі\\, перед ним повинен стояти символ \"t\" (табулятор).\n"..
    "\n"..
    "Дисплей оновлюється не частіше\\, ніж раз на дві секунди.\n"..
    "\n"..
    "\n"..
    "\n",
    "Сигнальна вежа може відображати червоний\\, зелений і оранжевий кольори. Комбінація цих трьох кольорів неможлива.\n"..
    "\n"..
    "\n"..
    "\n",
    "Як випливає з назви\\, контролер Lua повинен бути запрограмований мовою програмування Lua. Посібник англійською мовою доступний тут:\n"..
    "\n"..
    "https://github.com/joe7575/techage/blob/master/manuals/ta4_lua_controller_EN.md\n"..
    "\n"..
    "Контролеру Lua також потрібна батарея. Батарея повинна розташовуватися в безпосередній близькості від контролера\\, тобто в одному з 26 положень навколо контролера.\n"..
    "\n"..
    "\n"..
    "\n",
    "Сервер використовується для централізованого зберігання даних кількох контролерів Lua. Він також зберігає дані після перезапуску сервера.\n"..
    "\n"..
    "\n"..
    "\n",
    "Блок датчиків TA4 використовується для організації автоматичних складів або торгових автоматів у поєднанні з контролером Lua.\n"..
    "Якщо щось покласти в ящик або прибрати\\, або натиснути одну з клавіш \"F1\" / \"F2\"\\, на контролер Lua буде надіслано сигнал про подію.\n"..
    "Блок датчиків підтримує такі команди:\n"..
    "\n"..
    "  - Статус ящика можна запитати через 'state = $send_cmnd(<num>\\, \"state\")'. Можливі відповіді: \"empty\"\\, \"loaded\"\\, \"full\".\n"..
    "  - Останню дію гравця можна запитати через 'name\\, action = $send_cmnd(<num>\\, \"action\")'. 'name' - це ім'я гравця. Як 'action' повертається одна з таких дій: \"put\"\\, \"take\"\\, \"f1\"\\, \"f2\".\n"..
    "  - Вміст ящика можна зчитати за допомогою команди 'stacks = $send_cmnd(<num>\\, \"stacks\")'. Див.: https://github.com/joe7575/techage/blob/master/manuals/ta4_lua_controller_EN.md#sensor-chest\n"..
    "  - Через '$send_cmnd(<num>\\, \"text\"\\, \"натисніть обидві кнопки і покладіть щось у скриню\")' текст може бути встановлений у меню сенсорного блока.\n"..
    "\n"..
    "Прапорець \"Дозволити публічний доступ до скрині\" дозволяє встановити\\, чи може ящик використовуватися всіма чи тільки гравцями\\, які мають тут права доступу/захисту.\n"..
    "\n"..
    "\n"..
    "\n",
    "Термінал використовується для введення/виведення даних для контролера Lua.\n"..
    "\n"..
    "\n"..
    "\n",
    "",
    "Змінився лише зовнішній вигляд кнопки/перемикача TA4. Функціональність така сама\\, як у кнопки/перемикача TA3. Однак\\, пізніше за допомогою меню гайкового ключа дані можна змінити.\n"..
    "\n"..
    "\n"..
    "\n",
    "Цей блок має дві кнопки\\, які можуть бути індивідуально налаштовані за допомогою меню гайкового ключа. Для кожної кнопки можна налаштувати маркування та адресу цільового блока. Крім того\\, для кожної кнопки можна налаштувати команду, що надсилається.\n"..
    "\n"..
    "\n"..
    "\n",
    "Цей блок має чотири кнопки\\, які можуть бути індивідуально налаштовані за допомогою меню гайкового ключа. Для кожної кнопки можна налаштувати маркування та адресу цільового блока. Крім того\\, для кожної кнопки можна налаштувати команду, що надсилається.\n"..
    "\n"..
    "\n"..
    "\n",
    "Цей блок має дві лампи\\, якими можна керувати окремо. Кожна лампа може відображати кольори \"червоний\"\\, \"зелений\" і \"бурштиновий\". Маркування обох ламп може бути налаштоване через меню гайкового ключа. Керування лампами здійснюється за допомогою таких команд:\n"..
    "\n"..
    "  - Переключіть лампу 1 на червоний колір: '$send_cmnd(1234\\, \"red\"\\, 1)'.\n"..
    "  - Переключіть лампу 2 на зелений колір: '$send_cmnd(1234\\, \"green \"\\, 2)'.\n"..
    "  - Переключіть лампу 1 на оранжевий колір: '$send_cmnd(1234\\, \"amber\"\\, 1)'.\n"..
    "  - Вимкніть лампу 2: '$send_cmnd(1234\\, \"off\"\\, 2)'.\n"..
    "\n"..
    "\n"..
    "\n",
    "Цей блок має чотири лампи\\, якими можна керувати окремо. Кожна лампа може відображати кольори \"червоний\"\\, \"зелений\" і \"бурштиновий\". Маркування всіх ламп може бути налаштоване через меню гайкового ключа. Керування лампами здійснюється за допомогою таких команд:\n"..
    "\n"..
    "  - Переключіть лампу 1 на червоний колір: '$send_cmnd(1234\\, \"red\"\\, 1)'.\n"..
    "  - Переключіть лампу 2 на зелений колір: '$send_cmnd(1234\\, \"green \"\\, 2)'.\n"..
    "  - Переключіть лампу 3 на оранжевий колір: '$send_cmnd(1234\\, \"amber\"\\, 3)'.\n"..
    "  - Вимкніть лампу 4: '$send_cmnd(1234\\, \"off\"\\, 4)'\n"..
    "\n"..
    "\n"..
    "\n",
    "Змінився лише зовнішній вигляд детектора гравців TA4. Функціональність залишилася такою самою\\, як і у детектора гравців TA3.\n"..
    "\n"..
    "\n"..
    "\n",
    "\n"..
    "\n"..
    "Збирач станів по черзі запитує стан усіх сконфігурованих машин. Якщо одна з машин досягла або перевищила попередньо налаштований статус\\, надсилається команда \"увімкнути\". Наприклад\\, багато машин можна легко відстежувати на предмет несправностей за допомогою контролера Lua.\n"..
    "\n",
    "Функціональність така сама\\, як і у детектора предметів TA3. Крім того\\, детектор підраховує передані предмети.\n"..
    "Цей лічильник можна запитати командою 'count' і скинути командою 'reset'.\n"..
    "\n"..
    "\n"..
    "\n",
    "Функціональність така сама\\, як і у детектора вузлів TA3.\n"..
    "\n"..
    "На відміну від детектора блоків TA3\\, тут контрольовані позиції можна налаштовувати індивідуально. Для цього необхідно натиснути кнопку \"Запис\". Потім необхідно клацнути на всіх блоках\\, положення яких необхідно перевірити. Потім необхідно натиснути кнопку \"Готово\".\n"..
    "\n"..
    "Можна вибрати до 4 блоків.\n"..
    "\n"..
    "\n"..
    "\n",
    "Детектор заряду вимірює стан заряду накопичувачів енергії електромережі кожні 8 с.\n"..
    "\n"..
    "Якщо значення падає нижче налаштовуваного порогу (точки перемикання)\\, надсилається команда (за замовчуванням: \"off\"). Якщо значення знову піднімається вище цієї точки перемикання\\, надсилається друга команда (за замовчуванням: \"on\"). Це дозволяє відключати споживачів від мережі\\, коли рівень заряду накопичувача енергії падає нижче заданої точки перемикання.\n"..
    "\n"..
    "Для цього детектор заряду повинен бути підключений до мережі через розподільну коробку. Детектор заряду налаштовується через меню гайкового ключа.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Датчик погляду TA4 генерує команду\\, коли на блок дивиться власник або інші налаштовані гравці\\, і надсилає другу команду\\, коли на блок більше не дивляться. Таким чином\\, він слугує заміною кнопок/перемикачів\\, наприклад\\, для відкривання/закривання дверей.\n"..
    "\n"..
    "Датчик погляду TA4 можна запрограмувати тільки за допомогою меню гайкового ключа. Якщо у вас в руках гайковий ключ\\, датчик не спрацює\\, навіть якщо на нього дивляться.\n"..
    "\n"..
    "\n"..
    "\n",
    "За допомогою секвенсора TA4 можна програмувати цілі процеси. Ось приклад:\n"..
    "\n"..
    "    -- this is a comment\n"..
    "    \\[1\\] send 1234 a2b\n"..
    "    \\[30\\] send 1234 b2a\n"..
    "    \\[60\\] goto 1\n"..
    "\n"..
    "  - Кожен рядок починається з числа\\, яке відповідає моменту часу '\\[<num>\\]'.\n"..
    "  - Для часу допускаються значення від 1 до 50000\n"..
    "  - 1 відповідає 100 мс\\, 50000 - приблизно 4 ігрові дні\n"..
    "  - Допускаються порожні рядки або коментарі ('-- comment').\n"..
    "  - За допомогою команди 'send <num> <command> <data>' ви можете надіслати команду блоку\n"..
    "  - За допомогою 'goto <num>' ви можете перейти на інший рядок / точку в часі\n"..
    "  - За допомогою 'stop' ви можете зупинити секвенсор із затримкою\\, щоб він не отримав нову команду\nвід кнопки або іншого блока (для завершення руху)\nБез 'stop' секвенсор переходить у режим зупинки одразу після виконання останньої команди.\n"..
    "\n"..
    "Секвенсор TA4 підтримує такі команди techage:\n"..
    "\n"..
    "  - 'goto <num>' Перехід до командного рядка і запуск секвенсора\n"..
    "  - 'stop' Зупинити секвенсор\n"..
    "  - 'on' і 'off' як псевдоніми для 'goto 1' і 'stop'.\n"..
    "\n"..
    "Команда 'goto' приймається лише тоді\\, коли секвенсор зупинений.\n"..
    "\n"..
    "Час циклу (за замовчуванням: 100 мс) може бути змінений для секвенсора через меню гайкового ключа.\n"..
    "\n"..
    "\n"..
    "\n",
    "",
    "Контролер переміщення TA4 схожий на \"Контролер дверей 2\"\\, але вибрані блоки не видаляються\\, а переміщуються.\n"..
    "Оскільки рухомі блоки можуть забирати з собою гравців і мобів\\, що стоять на блоці\\, з їхньою допомогою можна будувати ліфти і подібні транспортні системи.\n"..
    "\n"..
    "Інструкції:\n"..
    "\n"..
    "  - Налаштуйте контролер і навчіть блоки, що переміщуються, за допомогою меню (можна навчити до 16 блоків)\n"..
    "  - маршрут польоту\" повинен бути введений за допомогою специфікації x\\, y\\, z (відносно) (максимальна відстань - 1000 м)\n"..
    "  - Рух можна перевірити за допомогою кнопок меню \"Move A-B\" і \"Move B-A\".\n"..
    "  - Ви також можете пролітати крізь стіни або інші блоки\n"..
    "  - Цільова позиція блоків також може бути зайнята. У цьому випадку блоки зберігаються \"невидимо\". Це призначено для розсувних дверей і т.п.\n"..
    "\n"..
    "Контролер Move підтримує такі команди techage:\n"..
    "\n"..
    "  - 'a2b' Перемістіть блок з A в B.\n"..
    "  - 'b2a' Перемістіть блок з B в A.\n"..
    "  - 'move' Перемістити блок на іншу сторону\n"..
    "\n"..
    "Переключитися в режим роботи 'move xyz' можна через меню гайкового ключа. Після переключення підтримуються такі команди techage:\n"..
    "\n"..
    "  - 'move2' За допомогою цієї команди маршрут польоту також повинен бути заданий у вигляді вектора x\\,y\\,z.\nПриклад Lua-контролера: '$send_cmnd(MOVE_CTLR\\, \"move2\"\\, \"0\\,12\\,0\")'.\n"..
    "  - 'moveto' Переміщує блок у задану позицію призначення (позиція призначення дійсна для першого відміченого блока\\, решта блоків переміщуються відносно цієї позиції)\n"..
    "  - 'reset' переміщує блок(и) назад у вихідне положення\n"..
    "\n"..
    "*Важливі вказівки:*\n"..
    "\n"..
    "  - Якщо необхідно перемістити кілька блоків\\, то під час навчання потрібно спочатку натиснути на блок\\, в якому будуть перебувати гравці/моби.\n"..
    "  - Якщо використовується команда 'moveto'\\, вказана цільова позиція застосовується до блока\\, який першим натискається під час навчання.\n"..
    "  - Якщо блок\\, який повинен забрати гравця/моба\\, має зменшену висоту\\, її необхідно встановити в контролері за допомогою меню гайкового ключа (наприклад\\, height = 0.5). В іншому випадку гравець/моб не буде \"знайдений\" і не буде забраний.\n"..
    "\n"..
    "\n"..
    "\n",
    "Контролер повороту TA4 схожий на \"Контролер переміщення\"\\, але вибрані блоки не переміщуються\\, а повертаються навколо свого центру праворуч або ліворуч.\n"..
    "\n"..
    "Інструкції:\n"..
    "\n"..
    "  - Налаштуйте контролер і навчіть блоки, що переміщуються, за допомогою меню (можна навчити до 16 блоків)\n"..
    "  - Рух можна перевірити за допомогою кнопок меню \"Поворот ліворуч\" і \"Поворот праворуч\".\n"..
    "\n"..
    "Контролер повороту підтримує такі команди techage:\n"..
    "\n"..
    "  - 'left' Повернути ліворуч\n"..
    "  - 'right' Повернути праворуч\n"..
    "  - 'uturn' Розвернути на 180 градусів\n"..
    "\n"..
    "\n"..
    "\n",
    "TA4 містить серію потужних ламп\\, які дозволяють поліпшити освітлення або впоратися з особливими завданнями.\n"..
    "\n",
    "Світлодіодна лампа TA4 забезпечує швидкий та енергійний ріст усіх рослин\\, що містяться в моді 'farming'. Лампа освітлює поле 3x3\\, тому рослини можна вирощувати і під землею.\n"..
    "Лампа повинна бути встановлена на один блок над землею в центрі поля 3x3.\n"..
    "\n"..
    "Лампу також можна використовувати для вирощування квітів. Якщо помістити лампу над клумбою 3x3 із садового ґрунту (Garden Soil) (Мод 'compost')\\, квіти будуть рости автоматично (над і під землею).\n"..
    "\n"..
    "Ви можете збирати квіти за допомогою бота Signs Bot\\, який також має відповідний знак\\, який потрібно розмістити перед квітковим полем.\n"..
    "\n"..
    "Лампа споживає 1 кю електроенергії.\n"..
    "\n"..
    "\n"..
    "\n",
    "Вуличний світлодіодний світильник TA4 - це світильник з особливо сильним освітленням. Світильник складається з корпуса\\, кронштейна і блоків для стовпів.\n"..
    "\n"..
    "Струм повинен бути підведений знизу через щоглу до корпусу лампи. Спочатку протягніть силовий кабель вгору\\, а потім \"заштукатурте\" його за допомогою блоків щогл для ламп.\n"..
    "\n"..
    "Лампа споживає 1 ku електроенергії.\n"..
    "\n"..
    "\n"..
    "\n",
    "Світлодіодна промислова лампа TA4 - це лампа з особливо сильним освітленням. Живлення лампи повинно здійснюватися зверху.\n"..
    "\n"..
    "Лампа споживає 1 ku електроенергії.\n"..
    "\n"..
    "\n"..
    "\n",
    "Світлофор TA4 може бути у двох варіантах: чорному (європейська версія) і жовтому (американська версія). Крім того\\, до комплекту входять щогла\\, кронштейн і з'єднувальний блок. Світлофор може бути встановлений на щоглі. Однак він не може бути встановлений на кронштейні. Це зумовлено технічними причинами. Тому існує з'єднувальний блок\\, який поміщається між кронштейном і світлофором.\n"..
    "\n"..
    "Світлофором можна керувати за допомогою команд\\, аналогічних командам TA4 сигнальної вежі. Якщо також використовується TA4 детектор гравців\\, світлофор може реагувати на пішоходів або транспортні засоби.\n"..
    "\n"..
    "Світлофор не потребує електрики.\n"..
    "\n"..
    "\n"..
    "\n",
    "Рідинний фільтр відфільтровує червоний шлам.\n"..
    "Частина червоного шламу перетворюється на луг\\, який можна зібрати на дні в резервуар.\n"..
    "Інша частина стає пустельним булижником і засмічує фільтрувальний матеріал.\n"..
    "Якщо фільтр сильно засмітився\\, його необхідно очистити і заново наповнити.\n"..
    "Фільтр складається з базового шару\\, 7 однакових фільтрувальних шарів і верхнього шару наповнювача.\n"..
    "\n"..
    "\n"..
    "\n",
    "Ви можете побачити структуру цього шару на плані.\n"..
    "\n"..
    "Луг збирається в резервуарі.\n"..
    "\n"..
    "\n"..
    "\n",
    "Цей шар повинен бути заповнений гравієм\\, як показано на плані.\n"..
    "Усього повинно бути сім шарів гравію.\n"..
    "З часом фільтр засмічується\\, і його доводиться чистити і наповнювати заново.\n"..
    "\n"..
    "\n"..
    "\n",
    "Цей шар використовується для наповнення фільтра червоним шламом.\n"..
    "Червоний шлам повинен бути закачаний у заливну трубу.\n"..
    "\n"..
    "\n"..
    "\n",
    "Колайдер - це дослідницький центр\\, в якому проводяться фундаментальні дослідження. Тут можна отримати очки досвіду\\, які потрібні для TA5 (Future Age).\n"..
    "\n"..
    "Як і його оригінал у ЦЕРНі в Женеві\\, колайдер повинен бути побудований під землею. Стандартна глибина тут - Y <= -28. Однак це значення може бути змінене персоналом сервера через конфігурацію. Ви можете запитати в інших гравців у чаті або скористатися блоком \"TA4 Побудовник детектора колайдера\".\n"..
    "\n"..
    "На одного гравця може припадати лише один колайдер. Тому немає сенсу встановлювати два або більше колайдерів. Очки досвіду нараховуються гравцю\\, який володіє колайдером. Очки досвіду не можуть бути передані.\n"..
    "\n"..
    "Колайдер складається з \"кільця\"\\, що складається з трубок і магнітів\\, а також детектора із системою охолодження.\n"..
    "\n"..
    "  - Детектор - це серце системи. Саме тут проводяться наукові експерименти. Детектор має розмір 3x3x7 блоків.\n"..
    "  - 22 магніти колайдера TA4 (не магніти детектора колайдера TA4!) повинні бути з'єднані один з одним через 5 блоків вакуумної труби TA4. Кожен магніт також потребує електрики і газового з'єднання для охолодження. Все це утворює (як показано на плані праворуч) квадрат з довжиною сторони 37 метрів (блоків).\n"..
    "\n"..
    "На плані об'єкт показаний зверху:\n"..
    "\n"..
    "  - сірий блок - це детектор з робочим блоком у центрі\n"..
    "  - червоні блоки - магніти\\, сині - вакуумні труби\n"..
    "\n"..
    "\n"..
    "\n",
    "Встановлення детектора відбувається автоматично за допомогою блока \"TA4 Побудовник детектора колайдера\" (аналогічно буровій вишці). Всі необхідні для цього матеріали повинні бути спочатку поміщені в блок побудовника. На блоці побудовника схематично зображений детектор. Детектор будується над блоком побудовника.\n"..
    "\n"..
    "Детектор також можна знову розібрати за допомогою побудовника детектора.\n"..
    "\n"..
    "Роз'єми для підключення електрики\\, газу і вакуумних труб розташовані на двох передніх сторонах детектора. Зверху повинен бути підключений насос TA4 однією всмоктувальною стороною для створення вакууму.\n"..
    "\n"..
    "Система охолодження повинна бути підключена до задньої частини детектора. Система охолодження показана на плані праворуч. На додаток до теплообмінника TA4 блока сховища енергії (який використовується тут для охолодження) необхідний блок охолоджувача TA4.\n"..
    "\n"..
    "Примітка: Стрілка на теплообміннику повинна бути спрямована в протилежну сторону від детектора. До теплообмінника також повинна бути підведена електрика.\n"..
    "\n"..
    "\n"..
    "\n"..
    "  - Крім того\\, потрібне охолодження\\, яке також повинно бути встановлене на детекторі. Для охолодження потрібен ізобутан.\n"..
    "  - Система потребує досить багато електроенергії і потребує підключення до електромережі.\n"..
    "\n",
    "Колайдер керується через TA4 термінал керування (не через термінал TA4 Lua-контролера).\n"..
    "\n"..
    "Цей термінал повинен бути підключений до детектора колайдера. Номер детектора відображається у вигляді інформаційного тексту на блоці побудовника колайдера.\n"..
    "\n"..
    "Термінал підтримує такі команди:\n"..
    "\n"..
    "  - 'connect <номер>' (підключення до детектора)\n"..
    "  - 'start' (запуск детектора)\n"..
    "  - 'stop' (зупинити детектор)\n"..
    "  - 'test <номер>' (перевірка магніта)\n"..
    "  - 'points' (запит уже отриманих очок досвіду)\n"..
    "\n"..
    "Якщо під час 'start' на магніті сталася помилка\\, виводиться номер магніта. Команда 'test' може бути використана для запиту додаткової інформації про помилку магніта.\n"..
    "\n"..
    "\n"..
    "\n",
    "Кожен магніт колайдера TA4 також повинен бути забезпечений електрикою (як показано праворуч на плані) та ізобутаном для охолодження:\n"..
    "\n"..
    "  - Роз'єм для підключення живлення знаходиться на верхній частині магніта.\n"..
    "  - З'єднання для охолодження знаходиться на передній панелі магніта.\n"..
    "  - Для охолодження всієї системи також потрібен насос TA4 і резервуар TA4 з не менш ніж 250 одиницями ізобутану.\n"..
    "  - Система також потребує багато електроенергії. Споживана потужність колайдера дорівнює 145 ku.\n"..
    "\n"..
    "\n"..
    "\n",
    "При налаштуванні колайдера рекомендується дотримуватися такої послідовності дій:\n"..
    "\n"..
    "  - Встановіть блок примусового завантаження карти (forceload). Детектор із системою охолодження повинен повністю перебувати в зоні блока примусового завантаження карти (forceload).\n"..
    "  - Встановіть блок побудовника детектора колайдера\\, заповніть його необхідними предметами і налаштуйте детектор через меню\n"..
    "  - Зберіть кільце з труб і магнітів\n"..
    "  - Підключіть усі магніти і детектор за допомогою кабелів живлення\n"..
    "  - З'єднайте всі магніти і детектор жовтими трубами і закачайте ізобутан у систему труб за допомогою насоса\n"..
    "  - Встановіть насос TA4 як вакуумний насос на детектор і увімкніть його (додатковий резервуар не потрібен). Якщо насос переходить у режим \"очікування\"\\, значить\\, вакуум створено. Це займе деякий час.\n"..
    "  - Зберіть охолоджувач (теплообмінник) і підключіть його до кабелю живлення\n"..
    "  - Розташуйте \"TA4 Термінал керування\" перед детектором і підключіть його до детектора через команду 'connect <number>'.\n"..
    "  - Увімкніть/підключіть джерело живлення\n"..
    "  - Увімкніть охолоджувач (теплообмінник)\n"..
    "  - Увімкніть детектор за допомогою 'start' на TA4 терміналі. Після кількох тестових кроків детектор перейде в нормальний режим роботи або видасть помилку.\n"..
    "  - Колайдер повинен працювати безперервно\\, а потім поступово приносити очки досвіду. Щоб отримати 10 очок\\, колайдер повинен працювати кілька годин.\n"..
    "\n"..
    ".\n"..
    "\n",
    "",
    "У блоці рецептів можна зберегти до 10 рецептів. Потім ці рецепти можна викликати за допомогою команди TA4 Autocrafter. Це дозволяє налаштувати рецепт автокрафтера за допомогою команди. Рецепти в блоці рецептів також можуть бути запитані безпосередньо за допомогою команди.\n"..
    "\n"..
    "'input <index>' зчитує рецепт з блока рецептів TA4. '<index>' - це номер рецепта. Блок повертає список інгредієнтів рецепта.\n"..
    "\n"..
    "Приклад: '$send_cmnd(1234\\, \"input\"\\, 1)'.\n"..
    "\n"..
    "\n"..
    "\n",
    "Функціонал відповідає TA3 Автокрафтеру.\n"..
    "\n"..
    "Потужність обробки становить 4 предмети кожні 4 с. Для цього автокрафтеру потрібно 9 ku електроенергії.\n"..
    "\n"..
    "Крім того\\, автокрафтер TA4 підтримує вибір різних рецептів за допомогою таких команд:\n"..
    "\n"..
    "'recipe \"<number>.<index>\"' переключає автокрафтер на рецепт з блока рецептів TA4. '<number>' - номер блока рецептів\\, '<index>' - номер рецепта. Приклад: '$send_cmnd(1234\\, \"recipe\"\\, \"5467.1\")'.\n"..
    "\n"..
    "Крім того\\, рецепт можна вибрати через список інгредієнтів\\, наприклад:\n"..
    "'$send_cmnd(1234\\, \"recipe\"\\, \"default:coal_lump\\,\\,\\,default:stick\")'\n"..
    "Тут повинні бути вказані всі технічні назви рецепта\\, розділені комами. Див. також команду 'input' у блоці рецептів TA4.\n"..
    "\n"..
    "Команда 'flush' переміщує всі предмети з вхідного інвентарю у вихідний інвентар. Команда повертає 'true'\\, якщо вхідний інвентар був повністю спорожнений. Якщо повертається 'false' (вихідний інвентар заповнений)\\, команду потрібно повторити пізніше.\n"..
    "\n"..
    "\n"..
    "\n",
    "Див. TA3 Резервуар.\n"..
    "\n"..
    "TA4 Резервуар вміщує 2000 одиниць або 200 бочок рідини.\n"..
    "\n"..
    "\n"..
    "\n",
    "Див. TA3 Насос.\n"..
    "\n"..
    "Насос TA4 перекачує 8 одиниць рідини кожні дві секунди.\n"..
    "\n"..
    "У режимі \"Обмежувач витрати\" можна обмежити кількість одиниць\\, що перекачуються насосом. Режим обмеження витрати можна активувати через меню гайкового ключа\\, задавши в ньому кількість одиниць. Після перекачування заданої кількості одиниць насос вимкнеться. При повторному вмиканні насос знову перекачає задану кількість одиниць\\, а потім вимкнеться.\n"..
    "\n"..
    "Обмежувач витрати також може бути налаштований і запущений за допомогою контролера Lua або Beduino.\n"..
    "\n"..
    "Насос також підтримує команду 'flowrate'. Це дозволяє запитувати загальну витрату через насос.\n"..
    "\n"..
    "\n"..
    "\n",
    "TA3 Промислова піч може бути вдосконалена\\, і модернізована на електричний нагрів. Нафтова топка і нагнітач можуть бути замінені на ТА4 Нагрівач печі.\n"..
    "\n"..
    "Для роботи нагрівача потрібно 14 ku електроенергії.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Цей блок більше не може бути виготовлений і буде замінений блоком TA4 Водозабір.\n"..
    "\n",
    "Для деяких рецептів потрібна вода. Воду потрібно качати з моря за допомогою насоса (вода при y = 1). Басейну з декількох блоків води для цього недостатньо!\n"..
    "\n"..
    "Для цього водозабірний блок необхідно помістити у воду і підключити до насоса за допомогою труб. Якщо блок поміщений у воду\\, необхідно переконатися\\, що під ним є вода (глибина повинна становити не менше 2 блоків).\n"..
    "\n"..
    "\n"..
    "\n",
    "На рівні розвитку TA4 є вдосконалені труби. Їх можна використовувати як стандартні труби замість ТА3 труб.\n"..
    "Зауваження: TA4 Штовхачі та TA4 Розподільники досягають своєї максимальної продуктивності лише при використанні труб TA4.\n"..
    "\n"..
    "\n"..
    "\n",
    "Функції в основному відповідають штовхачам TA2 / TA3. Крім того\\, за допомогою меню можна налаштувати\\, які предмети повинні бути взяті зі скрині TA4 і транспортовані далі.\n"..
    "Потужність обробки становить 12 предметів кожні 2 с\\, якщо з обох сторін використовуються труби TA4. В іншому випадку кожні 2 с обробляється лише 6 предметів.\n"..
    "\n"..
    "У режимі \"Обмежувач потоку\" можна обмежити кількість предметів\\, що переміщуються штовхачем. Режим обмеження витрати можна активувати через меню гайкового ключа\\, задавши в ньому кількість предметів. Як тільки задана кількість предметів буде переміщена\\, штовхач вимкнеться. При повторному вмиканні штовхач знову переміщує задану кількість предметів\\, а потім вимикається.\n"..
    "\n"..
    "Штовхач TA4 також можна налаштувати і запустити за допомогою контролера Lua або Beduino.\n"..
    "\n"..
    "Ось додаткові команди для контролера Lua:\n"..
    "\n"..
    "  - 'config' використовується для налаштування штовхача\\, аналогічно ручному налаштуванню через меню.\n Приклад: '$send_cmnd(1234\\, \"config\"\\, \"default:dirt\")'.\n За допомогою '$send_cmnd(1234\\, \"config\"\\, \"\")' конфігурація видаляється\n"..
    "  - 'limit' використовується для встановлення кількості елементів для режиму обмежувача витрати:\n Приклад: '$send_cmnd(1234\\, \"init\"\\, 7)'.\n"..
    "\n"..
    "\n"..
    "\n",
    "Функціональність така сама\\, як TA3. Скриня вміщує більше вмісту.\n"..
    "\n"..
    "Крім того\\, у скрині TA4 є тіньовий інвентар для налаштування. Тут певні комірки можуть бути призначені під певні предмети. При заповненні комірки з заздалегідь призначеними предметами заповнюються лише цими предметами. Для спорожнення заздалегідь призначених комірок потрібен штовхач TA4 або інжектор TA4 з відповідною конфігурацією.\n"..
    "\n"..
    "\n"..
    "\n",
    "Скриня TA4 8x2000 не має звичайного інвентарю\\, як інші скрині\\, а складається з 8 магазинів\\, у кожному з яких може зберігатися до 2000 предметів одного виду. Оранжеві кнопки зі стрілкою використовуються для переміщення предметів у магазин або з нього. Скриню також можна заповнити або спорожнити за допомогою штовхача (TA2\\, TA3 або TA4)\\, як звичайну.\n"..
    "\n"..
    "Якщо скриня заповнена штовхачем\\, всі магазини заповнюються зліва направо. Якщо всі 8 магазинів заповнені і більше не можна додати жодного предмета\\, подальші предмети не обробляються.\n"..
    "\n"..
    "*Функція ряду*\n"..
    "\n"..
    "Кілька скринь TA4 8x2000 можна з'єднати в одну велику скриню зі збільшеною кількістю вмісту. Для цього скрині потрібно поставити в ряд одну за одною.\n"..
    "\n"..
    "Спочатку потрібно поставити передню скриню\\, потім за нею ставляться скрині з такою ж орієнтацією в напрямку до гравця (всі ящики розташовуються фронтальною частиною до гравця). При розміщенні 2 скринь у ряд розмір збільшується до 8x4000 тощо.\n"..
    "\n"..
    "Ряди скринь більше не можна прибрати. Є два способи розібрати скрині:\n"..
    "\n"..
    "  - Спорожніть і зніміть передню скриню. Це розблокує наступну скриню\\, яку можна прибрати.\n"..
    "  - Спорожніть передню скриню настільки\\, щоб у всіх магазинах було не більше 2000 предметів. Це розблокує наступну скриню\\, і її можна буде прибрати.\n"..
    "\n"..
    "У скринях є прапорець \"замовити\". Якщо цей прапорець активований\\, магазини більше не будуть повністю спорожнюватися штовхачем. За замовчуванням у сховищі залишається останній предмет. Це призводить до фіксованого розподілу предметів по місцях зберігання.\n"..
    "\n"..
    "Скриня може бути використана лише гравцями\\, які можуть будувати в цьому місці\\, тобто мають право на захист. Не має значення\\, хто встановлює скриню.\n"..
    "\n"..
    "У скрині є додаткова команда для контролера Lua:\n"..
    "\n"..
    "  - 'count' використовується для запиту кількості предметів у скрині.\nПриклад 1: '$send_cmnd(CHEST\\, \"count\")' -> Сума товарів по всіх 8 магазинах\nПриклад 2: '$send_cmnd(CHEST\\, \"count\"\\, 2)' -> кількість товарів у магазині 2 (другий зліва)\n"..
    "  - 'storesize' використовується для читання розміру одного з восьми сховищ:\nПриклад: '$send_cmnd(CHEST\\, \"storesize\")' -> функція повертає\\, наприклад\\, 6000\n"..
    "\n"..
    "\n"..
    "\n",
    "Функціональність така сама\\, як TA2 Розподільник\\, з однією відмінністю:\n"..
    "За умови\\, що з усіх сторін використовуються трубки TA4\\, продуктивність обробки становить 24 предмети кожні 4 с. В іншому випадку кожні 4 с обробляється лише 12 елементів.\n"..
    "\n"..
    "\n"..
    "\n",
    "Функціональність така сама\\, як TA4 Розподільник\\, з двома відмінностями:\n"..
    "За умови\\, що з усіх сторін використовуються трубки TA4\\, продуктивність обробки становить 36 предметів кожні 4 с. В іншому випадку кожні 4 с обробляється лише 18 елементів.\n"..
    "Крім того\\, для кожного напрямку можна налаштувати до 8 елементів.\n"..
    "\n"..
    "\n"..
    "\n",
    "Функціональність така сама\\, як TA2.\n"..
    "Продуктивність обробки становить 4 елементи кожні 4 секунди. Блок потребує 5 ku електроенергії.\n"..
    "\n"..
    "\n"..
    "\n",
    "Функціональність така сама\\, як TA2.\n"..
    "Продуктивність обробки становить 4 елементи кожні 4 секунди. Блок потребує 9 ku електроенергії.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Функціональність практично така сама\\, як TA2 Кар'єр.\n"..
    "\n"..
    "Крім того\\, розмір виробки може бути встановлений у діапазоні від 3x3 до 11x11 блоків.\n"..
    "Максимальна глибина - 80 метрів. Для роботи кар'єру потрібно 14 ku електроенергії.\n"..
    "\n"..
    "\n"..
    "\n",
    "Водовидалювач видаляє воду з площі до 21 x 21 x 80 м. Основне призначення - осушення печер.\n"..
    "Але з його допомогою можна також \"пробурити\" отвір у морі.\n"..
    "Для роботи водовидалювача необхідні електрика і підключення до резервуара з рідиною.\n"..
    "Водовидалювач\\, що знаходиться в найвищій точці печери\\, видаляє воду\n"..
    "з печери до найнижчої її точки. Водовидалювач прибирає один блок води кожні дві секунди.\n"..
    "Прилад потребує 10 ku електроенергії.\n"..
    "\n"..
    "Технічно Водовидалювач замінює водяні блоки спеціальним повітряним блоком\\, який не видимий\\, але перешкоджає зворотному стоку води.\n"..
    "\n"..
    "\n"..
    "\n",
    "Функціональність така сама\\, як TA2 Електронна фабрика\\, тільки тут можливо виробляти інші чипи.\n"..
    "Продуктивність становить один чип кожні 6 с. Для цього блоку потрібно 12 ku електроенергії.\n"..
    "\n"..
    "\n"..
    "\n",
    "Функціональність така сама\\, як TA3.\n"..
    "\n"..
    "Продуктивність становить до 8 разів по 4 предмети кожні 4 секунди.\n"..
    "\n"..
    "\n"..
    "\n",
    "Переробник - це машина\\, яка обробляє всі рецепти Techage у зворотному порядку\\, тобто може розбирати машини і блоки на складові.\n"..
    "\n"..
    "Машина може розібрати практично всі блоки Techage і Hyperloop. Але не всі предмети/матеріали можуть бути перероблені:\n"..
    "\n"..
    "  - Дерево перетворюється на палиці\n"..
    "  - Камінь перетворюється на пісок або гравій\n"..
    "  - Напівпровідники / мікросхеми не можуть бути перероблені\n"..
    "  - Інструменти не можуть бути перероблені\n"..
    "\n"..
    "Продуктивність становить один елемент кожні 8 секунд. Для цього блоку потрібно 16 ku електроенергії.\n"..
    "\n"..
    "\n"..
    "\n",
  },
  images = {
    "techage_ta4",
    "",
    "ta4_windturbine",
    "ta4_nacelle",
    "ta4_blinklamp",
    "ta4_pillar",
    "",
    "ta4_solarmodule",
    "ta4_solarcarrier",
    "ta4_solar_inverter",
    "ta4_powercable",
    "ta4_powerbox",
    "ta4_minicell",
    "",
    "ta4_heatexchanger",
    "ta4_turbine",
    "ta4_generator",
    "ta4_pipeinlet",
    "ta4_pipe",
    "ta4_transformer",
    "ta4_transformer",
    "ta4_electricmeter",
    "ta4_laser",
    "ta4_hydrogen",
    "ta4_electrolyzer",
    "ta4_fuelcell",
    "",
    "ta4_doser",
    "ta4_reactor",
    "ta4_fillerpipe",
    "ta4_reactorstand",
    "ta4_reactorbase",
    "ta4_silo",
    "ta4_icta_controller",
    "ta4_icta_controller",
    "ta4_battery",
    "ta4_display",
    "ta4_displayXL",
    "ta4_signaltower",
    "ta4_lua_controller",
    "ta4_lua_server",
    "ta4_sensor_chest",
    "ta4_terminal",
    "",
    "ta4_button",
    "ta4_button_2x",
    "ta4_button_4x",
    "ta4_signallamp_2x",
    "ta4_signallamp_4x",
    "ta4_playerdetector",
    "ta4_collector",
    "ta4_detector",
    "ta4_nodedetector",
    "ta4_chargedetector",
    "ta4_gaze_sensor",
    "ta4_sequencer",
    "",
    "ta4_movecontroller",
    "ta4_turncontroller",
    "",
    "ta4_growlight",
    "ta4_streetlamp",
    "ta4_industriallamp",
    "ta4_trafficlight",
    "ta4_liquid_filter",
    "",
    "",
    "",
    "",
    "",
    "ta4_terminal",
    "",
    "techage_ta4c",
    "",
    "ta4_recipeblock",
    "ta4_autocrafter",
    "ta4_tank",
    "ta4_pump",
    "ta4_furnaceheater",
    "",
    "ta4_waterinlet",
    "ta4_tube",
    "ta4_pusher",
    "ta4_chest",
    "ta4_8x2000_chest",
    "ta4_distributor",
    "ta4_high_performance_distributor",
    "ta4_gravelsieve",
    "ta4_grinder",
    "ta4_quarry",
    "ta4_waterremover",
    "ta4_electronicfab",
    "ta4_injector",
    "ta4_recycler",
  },
  plans = {
    "",
    "ta4_windturbine",
    "",
    "",
    "",
    "",
    "ta4_solarplant",
    "",
    "",
    "",
    "",
    "",
    "",
    "ta4_storagesystem",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "ta4_reactor",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "ta4_liquid_filter_base",
    "ta4_liquid_filter_gravel",
    "ta4_liquid_filter_top",
    "techage_collider_plan",
    "ta4_cooler",
    "",
    "techage_collider_plan2",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
  }
}
