return {
  titles = {
    "1,TA1: Залізна доба",
    "2,Піролізна піч",
    "2,Плавильна піч",
    "2,Водяний млин",
    "3,TA1 Млин",
    "3,TA1 Шлюзовий затвор",
    "3,TA1 Рукоятка шлюзу",
    "3,TA1 Дошка з яблуневого дерева",
    "3,TA1 Яблунева дошка для млинового каналу",
    "2,Руди та інструменти",
    "3,Молот",
    "3,Сито для просіювання гравію",
    "3,Лійка",
    "3,Просіювання гравію за допомогою лійки",
    "3,Меридій",
  },
  texts = {
    "TA1 - це видобуток достатньої кількості руди та виробництво деревного вугілля за допомогою простих інструментів і обладнання\\, щоб у TA2 можна було виробляти й експлуатувати машини.\n"..
    "\n"..
    "Зрозуміло\\, що для залізної доби необхідне залізо\\, а не лише сталь\\, як у «Minetest Game». Внаслідок цього деякі рецепти було змінено так\\, що спочатку має бути вироблене залізо\\, а потім сталь.\n"..
    "\n"..
    "Довговічність інструментів залежить від епохи і тому не відповідає оригінальній грі Minetest.\n"..
    "Наприклад\\, довговічність / твердість для сокири:\n"..
    "\n"..
    "  - Бронза: 20\n"..
    "  - Сталь: 30\n"..
    "\n"..
    "\n"..
    "\n",
    "Піролізна піч потрібна для отримання деревного вугілля. Деревне вугілля необхідне для плавильної печі\\, а також\\, наприклад\\, у TA2 для парового двигуна.\n"..
    "\n"..
    "Для піролізної печі вам знадобляться:\n"..
    "\n"..
    "  - блок розпалювання ('techage:lighter')\n"..
    "  - 26 дерев'яних блоків\\, які складаються у купу дров. Тип деревини не має значення\n"..
    "  - Земля\\, щоб закрити доступ повітря до купи дров\n"..
    "  - Кресало (технічна назва: 'fire:flint_and_steel')\\, щоб підпалити блок розпалювання.\n"..
    "\n"..
    "Інструкції з будівництва (див. також план):\n"..
    "\n"..
    "  - Побудуйте майданчик 5x5 із землі.\n"..
    "  - Покладіть 7 дерев'яних брусків навколо блоку розпалювання\\, але залиште отвір для кресала\n"..
    "  - Покладіть зверху ще 2 шари дерева\\, щоб вийшов дерев'яний куб 3x3x3\n"..
    "  - Вкрийте все шаром землі\\, щоб вийшов куб 5x5x5\\, але отвір для кресала залиште відкритим\n"..
    "  - Підпаліть розпалювання і одразу ж закрийте отвір дерев'яним блоком і землею.\n"..
    "  - Якщо ви все зробили правильно\\, піролізна піч почне димити за кілька секунд.\n"..
    "  - Відкривайте піролізну піч лише тоді\\, коли дим зникне (приблизно через 20 хвилин).\n"..
    "\n"..
    "Тоді ви зможете видобути 9 вугільних блоків і знову наповнити піролізну піч.\n"..
    "\n"..
    "\n"..
    "\n",
    "Плавильна піч потрібна\\, наприклад\\, для того\\, щоб плавити залізо та інші руди в плавильному котлі. Існують різні рецепти\\, що потребують різної температури. Чим вища плавильна піч\\, тим гарячіше полум'я. Для всіх рецептів підходить висота 11 блоків над опорною плитою\\, але для горілки такої висоти потрібно більше деревного вугілля.\n"..
    "\n"..
    "Інструкції з будівництва (див. також план):\n"..
    "\n"..
    "  - Побудуйте кам'яну вежу (бруківка) з основою 3x3 (висота 7-11 блоків)\n"..
    "  - Залиште відкритим отвір з одного боку внизу.\n"..
    "  - Покладіть у нього розпалювання\n"..
    "  - Наповніть вежу до країв деревним вугіллям\\, опускаючи вугілля в отвір зверху\n"..
    "  - Підпаліть розпалювання через отвір\n"..
    "  - Помістіть плавильний котел на вершину вежі прямо в полум'я\\, на один блок вище краю вежі.\n"..
    "  - Щоб зупинити горілку\\, тимчасово закрийте отвір\\, наприклад\\, блоком землі.\n"..
    "\n"..
    "Плавильний котел має власне меню рецептів та інвентар\\, до якого потрібно складати руди.\n"..
    "\n"..
    "\n"..
    "\n",
    "Водяний млин можна використовувати для перемелювання пшениці та інших зерен на борошно\\, а потім випікати їх у печі для приготування хліба. \n"..
    "Млин приводиться в рух силою води. Для цього до млинового колеса через канал потрібно підвести жорна.\n"..
    "Потік води і\\, відповідно\\, млинове колесо можна регулювати за допомогою шлюзу. Шлюз складається зі шлюзового замка та шлюзової ручки.\n"..
    "\n"..
    "На малюнку праворуч (натисніть на «План») показана структура водяного млина. \n"..
    "\n"..
    "\n"..
    "\n",
    "Водяний млин можна використовувати для перемелювання пшениці та інших зерен на борошно\\, а потім випікати їх у печі для приготування хліба. Млин має бути з'єднаний з млиновим колесом за допомогою осі TA1. Потужності млинового колеса вистачає лише на один млин.\n"..
    "\n"..
    "Млин можна автоматизувати за допомогою Minecart Hopper\\, щоб\\, наприклад\\, борошно прямо з млина доставлялося до печі для випікання з нього хліба.\n"..
    "\n"..
    "\n"..
    "\n",
    "Шлюзовий затвор потрібно встановити безпосередньо поруч зі ставком або струмком на тій же висоті\\, що й поверхня води.\n"..
    "Коли ворота відкриваються\\, вода тече через засувку. Потім ця вода подається на млинове колесо\\, де приводить у рух млин.\n"..
    "\n"..
    "\n"..
    "\n",
    "TA1 Рукоятку шлюзу потрібно встановити на воротах шлюзу. Ворота можна відкрити за допомогою рукоятки шлюзу (правий клік).\n"..
    "\n"..
    "\n"..
    "\n",
    "Дошки з різних порід дерева для будівництва каналу млина. Однак можна використовувати й будь-який інший матеріал.\n"..
    "\n"..
    "\n"..
    "\n",
    "Блок з різних порід дерева для будівництва каналу млина. Цей блок особливо підходить для з'єднання\n"..
    "зі стовпами дерев'яного паркану для створення опори каналу.\n"..
    "\n"..
    "\n"..
    "\n",
    "У TA1 є власні інструменти\\, такі як молоток і сито для гравію\\, але можна використовувати й бункер Minecart Hopper.\n"..
    "\n"..
    "\n"..
    "\n",
    "Молот TA1 можна використовувати для видовбування/розкопування каменю в шахті\\, а також для розбивання бруківки на гравій. Молот випускається в різних варіантах і\\, відповідно\\, з різними властивостями: бронзовий\\, сталевий\\, латунний та алмазний.\n"..
    "\n"..
    "\n"..
    "\n",
    "Руди можна відсіювати з гравію за допомогою сита для гравію. Для цього натисніть на сито з гравієм. Просіяний гравій та руди випадуть вниз.\n"..
    "\n"..
    "Щоб не стояти годинами біля сита\\, просіювання можна автоматизувати за допомогою бункера.\n"..
    "\n"..
    "\n"..
    "\n",
    "Лійка з мода «Minecart» використовується здебільшого для завантаження та розвантаження вагонеток. Вона підбирає предмети зверху і видає їх праворуч. Тому\\, розміщуючи лійку\\, звертайте увагу на напрямок видачі.\n"..
    "\n"..
    "Лійка також може діставати предмети зі скринь\\, якщо скриня стоїть на ній.\n"..
    "\n"..
    "Лійка також може класти предмети в скрині\\, якщо скриня знаходиться поруч з лійкою.\n"..
    "\n"..
    "\n"..
    "\n",
    "За допомогою двох скринь\\, двох лійок і сита для гравію можна автоматизувати процес просіювання. На плані праворуч показана конструкція.\n"..
    "\n"..
    "Переконайтеся\\, що скрині замкнені на «chest_lock»\\, інакше хтось вкраде цінні руди зі скрині внизу.\n"..
    "\n"..
    "\n"..
    "\n",
    "У TA1 існує металевий сплав меридій. Зливки меридію можна виготовити за допомогою печі на деревному вугіллі зі сталі та кристалів мезе. Меридій світиться в темряві. Інструменти з меридію також світяться і тому дуже корисні при підземному видобутку.\n"..
    "\n"..
    "\n"..
    "\n",
  },
  images = {
    "techage_ta1",
    "",
    "",
    "",
    "",
    "ta1_sluice",
    "ta1_sluice_handle",
    "ta1_board1",
    "ta1_board2",
    "ta1_gravelsieve",
    "hammer",
    "ta1_gravelsieve",
    "ta1_hopper",
    "",
    "meridium",
  },
  plans = {
    "",
    "coalpile",
    "coalburner",
    "watermill1",
    "watermill2",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "hoppersieve",
    "",
  }
}
