return {
  titles = {
    	"1,TA5: Майбутнє", 
	"2, Джерела енергії", 
	"3,TA5 Термоядерний реактор", 
	"4,TA5 Магніт термоядерного реактора", 
	"4,TA5 Насос", 
	"4,TA5 Теплообмінник", 
	"4,TA5 Контролер термоядерного реактора", 
	"4,TA5 Оболонка термоядерного реактора", 
	"4,TA5 Ядро термоядерного реактора", 
	"2,Сховище енергії", 
	"3,TA5 Гібридне сховище (планується)", 
	"2,Логічні блоки", 
	"2,Транспорт та дорожній рух", 
	"3,TA5 Контролер польоту", 
	"3,TA5 Hyperloop Скриня", 
	"3,TA5 Hyperloop Резервуар", 
	"2, Блоки телепортації", 
	"3,TA5 Телепортатор Предметів", 
	"3,TA5 Телепортатор Рідини", 
	"3,Телепортатори Hyperloop (планується)", 
	"2, Більше блоків/предметів TA5", 
	"3,TA5 Контейнер (планується)", 
	"3,TA5 AI Чіп", 
	"3,TA5 AI Чіп II",
  },
  texts = {
    "Машини для подолання простору і часу, нові джерела енергії та інші досягнення покращують ваше життя.\n"..
    "\n"..
    "Для виробництва та використання машин та блоків TA5 потрібні окуляри досвіду. Їх можна розробити лише за допомогою колайдера із TA4.\n"..
    "\n"..
    "\n"..
    "\n",
    "",
    "Ядерний синтез означає злиття двох атомних ядер. Залежно від реакції може виділятися велика кількість енергії. Ядерні синтези\\, при яких виділяється енергія\\, відбуваються у формі ланцюгових реакцій. Вони є джерелом енергії зірок\\, включно\\, наприклад\\, наше Сонце. Термоядерний реактор перетворює енергію\\, що виділяється в ході керованого ядерного синтезу\\, в електрику.\n"..
    "\n"..
    "*Як працюють термоядерні реактори?*\n"..
    "\n"..
"Термоядерний реактор працює за класичним принципом теплової електростанції: вода нагрівається і приводить в дію парову турбіну, кінетична енергія якої перетворюється генератором на електричну.\n".. 
"\n".. 
"Термоядерна електростанція спочатку вимагає великої кількості енергії\\, оскільки повинна бути створена плазма. «Плазма» — це назва четвертого стану речовини після твердого\\, рідкого і газоподібного. Це вимагає великої кількості електроенергії. Тільки завдяки цій екстремальній концентрації енергії запалюється реакція синтезу\\, а тепло, що виділяється, тепло використовується для вироблення. 800 ку електроенергії.\n".. 
"\n".. 
"На плані праворуч показаний розріз термоядерного реактора.\n".. 
"\n".. 
"Для роботи термоядерного реактора потрібно 60 очок досвіду. Термоядерний реактор повинен бути повністю побудований в області силового блоку.\n".. 
"\n".. 
"\n".. 
"\n", 
"Для встановлення термоядерного реактора потрібно загалом 60 магнітів термоядерного реактора TA5. Вони утворюють кільце\\, в якому формується плазма. Магніти термоядерного реактора TA5 вимагають живлення і мають два порти для охолодження.\n".. 
"\n".. 
"Існує два типи магнітів\\, тому всі сторони магніту\\, звернені до плазмового кільця\\, також можуть бути захищені теплозахисним екраном.\n".. 
"\n".. 
"За наявності кутових магнітів на внутрішній стороні кільця одна сторона з'єднання закрита (живлення або охолодження) і тому не може бути підключена. Це технічно нездійсненно і, отже, не впливає на роботу термоядерного реактора.\n".. 
"\n".. 
"\n".. 
"\n", 
"Насос необхідний для заповнення контуру охолодження ізобутаном. Потрібно близько 350 одиниць ізобутану.\n".. 
"\n".. 
"Примітка: Насос TA5 можна використовувати тільки для заповнення контуру охолодження\\, відкачування охолоджуючої рідини неможливе. Тому насос не слід включати\\, поки магніти не будуть правильно встановлені і всі лінії живлення та охолодження не будуть підключені.\n".. 
"\n".. 
"\n".. 
"\n", 
"Теплообмінник TA5 необхідний для перетворення тепла\\, що виробляється в термоядерному реакторі\\, спочатку в пар\\, а потім в електрику. Сам теплообмінник вимагає 5 ку електроенергії. Структура аналогічна теплообміннику енергосховища з TA4.\n".. 
"\n".. 
"Примітка: Теплообмінник TA5 має два з'єднання (синє та зелене) для контуру охолодження. Теплообмінник та всі магніти повинні бути підключені для формування контуру охолодження через зелені та сині труби.\n".. 
"\n".. 
"Перевірити цілісність контуру охолодження можна за допомогою кнопки запуску на теплообміннику\\, навіть якщо охолоджувальна рідина ще не залита.\n".. 
"\n".. 
"\n".. 
"\n", 
"Включення термоядерного реактора здійснюється через TA5 контролер термоядерного реактора. Спочатку необхідно включити охолодження/теплообмінник\\, а потім контролер. Для запуску реактора і подачі електроенергії потрібно близько 2 хвилин. Термоядерного реактора і, отже, контролеру потрібно 400.".. 
"\n".. 
"\n".. 
"\n", 
"Весь реактор повинен бути оточений оболонкою\\, яка поглинає величезний тиск\\, яке магніти надають на плазму\\, і захищає навколишнє середовище від радіації. Без цієї оболонки реактор не може бути запущений. За допомогою TechAge Кельма силові кабелі та охолоджувальні труби термоядерного реактора можуть бути інтегровані".. 
"\n".. 
"\n".. 
"\n", 
"Ядро має розташовуватися в центрі реактора. Див. ілюстрацію \"TA5 Термоядерний Реактор\". Для його встановлення потрібно TechAge кельми.\n".. 
"\n".. 
"\n".. 
"\n", 
"", 
"", 
"", 
"", 
"TA5 Контролер польоту схожий на контролер переміщення TA4. На відміну від контролера переміщення TA4\\, кілька рухів можна об'єднати в один маршрут польоту. Цей маршрут польоту можна визначити в полі введення за допомогою кількох записів x\\, y\\, z (один рух на рядок) Помилка помилки. помилці.\n".. 
"\n".. 
"Кнопкою «Тест» маршрут польоту з абсолютними координатами виводиться для перевірки в чаті.\n".. 
"\n".. 
"Максимальна дальність польоту протягом усього становить 1500 м. Можна навчити до 32 блоків.\n".. 
"\n".. 
"Для використання контролера польоту TA5 потрібно 40 очок досвіду.\n".. 
"\n".. 
"*Режим телепортації*\n".. 
"\n".. 
"Якщо включено режим «Телепортації»\\, гравця можна переміщати і без блоків. Для цього необхідно налаштувати початкову позицію за допомогою кнопки «Запис». Тут можна налаштувати тільки одну позицію. Переміщуваний гравець повинен знаходитися в цій позиції.\n".. 
"\n".. 
"\n".. 
"\n", 
"TA5 Hyperloop Скриня дозволяє транспортувати предмети по мережі Hyperloop.\n".. 
"\n".. 
"TA5 Hyperloop Скриня має бути розміщена на Hyperloop З'єднувачі. Скриня має спеціальне меню\\, за допомогою якого можна об'єднати дві скрині. Речі, що знаходяться в скрині, телепортуються на віддалену станцію. Скриня також можна заповнювати/спустошувати за допомогою штовхача.\n".. 
"\n".. 
"Для сполучення вам спочатку потрібно ввести назву скрині з одного боку\\, потім ви можете вибрати цю назву для іншої скрині і таким чином з'єднати два блоки.\n".. 
"\n".. 
"Для використання TA5 Hyperloop Скрині потрібно 15 очок досвіду.\n".. 
"\n".. 
"\n".. 
"\n", 
"TA5 Hyperloop Резервуар дозволяє транспортувати рідини по мережі Hyperloop.\n".. 
"\n".. 
"TA5 Hyperloop Резервуар має бути розміщений на Hyperloop З'єднувачі. Резервуар має спеціальне меню\\, за допомогою якого ви можете з'єднати два резервуари. Рідина в резервуарі буде телепортована на віддалену станцію. Резервуар також можна заповнювати/порожняти за допомогою насоса.\n".. 
"\n".. 
"Для пари спочатку необхідно ввести назву резервуара з одного боку\\, потім можна вибрати цю назву для іншого резервуара і таким чином з'єднати два блоки.\n".. 
"\n".. 
"Для використання TA5 Hyperloop Резервуара потрібно 15 очок досвіду.\n".. 
"\n".. 
"\n".. 
"\n", 
"Блоки телепортації дозволяють переносити речі між двома блоками телепортації без необхідності використання труби між ними. Щоб спарити блоки, спочатку потрібно ввести ім'я для блоку з одного боку, потім можна вибрати це ім'я для іншого блоку і таким чином з'єднати два блоки. Спарювання може бути виконане лише одним гравцем (ім'я гравця перевіряється) та має бути завершено до перезапуску сервера. В іншому випадку дані парування будуть втрачені.\n".. 
"\n".. 
"На карті праворуч показано\\, як можна використовувати блоки.\n".. 
"\n".. 
"\n".. 
"\n", 
"Ці телепортаційні блоки дозволяють переносити предмети і таким чином замінюють трубу. Можна подолати відстань до 500 блоків.\n".. 
"\n".. 
"Кожен блок телепорту вимагає 12 ку електроенергії.\n".. 
"\n".. 
"Для використання телепортаційних блоків потрібно 30 очок досвіду.\n".. 
"\n".. 
"\n".. 
"\n", 
"Ці телепортаційні блоки дозволяють переносити рідини і таким чином замінюють трубу. Можна подолати відстань до 500 блоків.\n".. 
"\n".. 
"Кожен блок телепорту вимагає 12 ку електроенергії.\n".. 
"\n".. 
"Для використання телепортаційних блоків потрібно 30 очок досвіду.\n".. 
"\n".. 
"\n".. 
"\n", 
"Телепортатори Hyperloop дозволяють побудувати мережу Hyperloop без труб Hyperloop.\n".. 
"\n".. 
"Для використання телепортаторів Hyperloop потрібно 60 очок досвіду.\n".. 
"\n", 
"", 
"Контейнер TA5 дозволяє упаковувати та розпаковувати системи Techage в іншому місці.\n".. 
"\n".. 
"Для використання контейнера TA5 потрібно 80 очок досвіду.\n".. 
"\n", 
"TA5 AI Чіп потрібний для виробництва деяких блоків TA5. Його можна виготовити лише на фабриці електроніки TA4. Для цього потрібно 10 очок досвіду.\n".. 
"\n".. 
"\n".. 
"\n", 
"Для створення TA5 термоядерного реактора потрібен чіп TA5 AI Чіп II. Його можна виготовити лише на заводі електроніки TA4. Для цього потрібно 25 очок досвіду.\n"..
    "\n"..
    "\n"..
    "\n",
  },
  images = {
    "techage_ta5",
    "",
    "",
    "ta5_magnet",
    "ta5_pump",
    "",
    "ta5_fr_controller",
    "ta5_fr_shell",
    "ta5_fr_nucleus",
    "",
    "",
    "",
    "",
    "ta5_flycontroller",
    "ta5_chest",
    "ta5_tank",
    "",
    "ta5_tele_tube",
    "ta5_tele_pipe",
    "",
    "",
    "",
    "ta5_aichip",
    "ta5_aichip2",
  },
  plans = {
    "",
    "",
    "ta5_fusion_reactor",
    "",
    "",
    "ta5_heatexchanger",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "ta5_teleport",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
  }
}
